Name: CraftManager
Description: Downloads the latest version of CraftManager and builds a package.
Identifier: com.github.smithjw-actions.pkg.CraftManager
ParentRecipe: com.github.smithjw-actions.download.CraftManager
MinimumVersion: 2.3
Input:
  NAME: CraftManager

Process:
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: '%pathname%'

  - Processor: PkgRootCreator
    Arguments:
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'
      pkgdirs:
        Applications: "0775"

  - Processor: Copier
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/%NAME%/CraftManager.app'
      destination_path: '%pkgroot%/Applications/CraftManager.app'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: '%NAME%-%version%'
        pkgdir: '%RECIPE_CACHE_DIR%'
        id: com.github.smithjw-actions.CraftManager
        options: purge_ds_store
        chown:
          - path: Applications
            user: root
            group: admin