Name: CraftManager
Description: Downloads the latest version of CraftManager.
Identifier: com.github.smithjw-actions.download.CraftManager
MinimumVersion: 2.3
Input:
  NAME: CraftManager
  SPARKLE_FEED_URL: https://craft-assets.invisionapp.com/CraftManager/production/appcast.xml

Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: Invision no longer exists as a company, thus this recipe is no longer necessary and will be removed soon.

  - Processor: SparkleUpdateInfoProvider
    Arguments:
      appcast_url: '%SPARKLE_FEED_URL%'

  - Processor: URLDownloaderPython
    Arguments:
      filename: CraftManager.zip

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: '%pathname%'
      destination_path: '%RECIPE_CACHE_DIR%/%NAME%'
      purge_destination: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/%NAME%/CraftManager.app'
      requirement: anchor apple generic and identifier "com.invisionlabs.CraftManager" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VRXQSNCL5W)