Description: Downloads the latest version of CraftManager and builds a package.
Identifier: com.github.smithjw-actions.pkg.CraftManager
ParentRecipe: com.github.smithjw-actions.download.CraftManager
MinimumVersion: '2.3'

Input:
  NAME: CraftManager

Process:
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: '%pathname%'

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: '0775'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

  - Processor: Copier
    Arguments:
      destination_path: '%pkgroot%/Applications/CraftManager.app'
      source_path: '%RECIPE_CACHE_DIR%/%NAME%/CraftManager.app'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: com.github.smithjw-actions.CraftManager
        options: purge_ds_store
        pkgdir: '%RECIPE_CACHE_DIR%'
        pkgname: '%NAME%-%version%'
