---
Description: Downloads the latest version of Wacom Intuos tablet drivers.
Identifier: com.github.smithjw-actions.download.WacomIntuos
MinimumVersion: '2.3'

Input:
  DOWNLOAD_PATTERN: '(https://cdn.wacom.com/u/productsupport/drivers/mac/professional/WacomTablet_+[0-9].+[0-9].+[0-9]*-*[0-9].dmg)'
  DOWNLOAD_URL: https://www.wacom.com/en-us/support/product-support/drivers
  NAME: Wacom Intuos Driver

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '%DOWNLOAD_PATTERN%'
      url: '%DOWNLOAD_URL%'

  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      filename: '%NAME%.dmg'
      url: '%match%'
      User_Agent: 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/126.0.0.0 Safari/537.36'

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: Wacom Technology Corp. (EG27766DY7)'
        - 'Developer ID Certification Authority'
        - 'Apple Root CA'
      input_path: '%pathname%/*.pkg'

  - Processor: EndOfCheckPhase
