Description: Create a package from the Neo4j Desktop download.
Identifier: com.github.smithjw-actions.pkg.Neo4j_Desktop_2
MinimumVersion: '2.9'
ParentRecipe: com.github.smithjw-actions.download.Neo4j_Desktop_2

Input:
  NAME: Neo4j Desktop 2
  SOFTWARE_TITLE: Neo4j_Desktop_2

Process:
  - Processor: AppPkgCreator
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
