Description: Downloads the latest version of Neo4j Desktop, packages it, then uploads it to Jamf.
Identifier: com.github.smithjw-actions.jamf.upload.Neo4j_Desktop
MinimumVersion: '2.3'
ParentRecipe: com.github.smithjw-actions.pkg.Neo4j_Desktop

Input:
  NAME: Neo4j Desktop
  SOFTWARE_TITLE: Neo4j_Desktop
  CATEGORY: Apps
  REMOVE_OLD_PACKAGES: 'true'
  PACKAGE_INFO: autopkg
  VERSIONS_TO_KEEP: 2

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      pkg_info: '%PACKAGE_INFO%'

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%REMOVE_OLD_PACKAGES% == false'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: '%SOFTWARE_TITLE%-'
      versions_to_keep: '%VERSIONS_TO_KEEP%'
