Description: Downloads the latest version of Neo4j Desktop, packages it, then uploads it to Jamf.
Identifier: com.github.smithjw-actions.jamf.upload.Neo4j_Desktop_2
ParentRecipe: com.github.smithjw-actions.pkg.Neo4j_Desktop_2
MinimumVersion: '2.3'

Input:
  NAME: Neo4j Desktop 2
  SOFTWARE_TITLE: Neo4j_Desktop_2
  CATEGORY: Apps
  REMOVE_OLD_PACKAGES: 'true'
  PACKAGE_INFO: autopkg
  PKG_TO_KEEP: '2'
  PKG_NAME_MATCH: '%SOFTWARE_TITLE%-'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      pkg_info: '%PACKAGE_INFO%'

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%REMOVE_OLD_PACKAGES% == false'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: '%PKG_NAME_MATCH%'
      versions_to_keep: '%PKG_TO_KEEP%'
