Description: Downloads the latest version of the DisplayLink Manager App.
Identifier: com.github.smithjw-actions.pkg.DisplayLink_Manager
ParentRecipe: com.github.smithjw-actions.download.DisplayLink_Manager
MinimumVersion: '2.3'

Input:
  NAME: DisplayLink Manager
  SOFTWARE_TITLE: DisplayLink_Manager

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
      pkgdirs:
        payload: '0775'
        scripts: '0775'

  - Processor: com.github.mlbz521.SharedProcessors/XarExtractSingleFile
    Arguments:
      archive_path: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%.pkg'
      file_to_extract: Distribution

  - Processor: com.github.mlbz521.SharedProcessors/XPathParser
    Arguments:
      xml_file: '%extracted_file%'
      xpath: './/pkg-ref[@id="com.displaylink.displaylinkmanagerapp"]/bundle-version/bundle[@path="DisplayLink Manager.app"]'
      attribute_one: CFBundleShortVersionString
      return_variable_attribute_one: version

  - Processor: com.github.mlbz521.SharedProcessors/XPathParser
    Arguments:
      xml_file: '%extracted_file%'
      xpath: './/os-version[@min]'
      attribute_one: min
      return_variable_attribute_one: minimum_os_version

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%.pkg'
      pkg_path: '%RECIPE_CACHE_DIR%/pkgroot/scripts/%SOFTWARE_TITLE%-%version%.pkg'

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%_Extension.dmg/%found_basename%'
      pkg_path: '%RECIPE_CACHE_DIR%/pkgroot/scripts/%SOFTWARE_TITLE%_Extension-%version%.pkg'

  - Processor: FileCreator
    Arguments:
      file_path: '%RECIPE_CACHE_DIR%/pkgroot/scripts/preinstall'
      file_mode: '0755'
      file_content: |
        #!/bin/bash

        DISPLAYLINK_PKG="%SOFTWARE_TITLE%-%version%.pkg"
        DISPLAYLINK_EXTENTION_PKG="%SOFTWARE_TITLE%_Extension-%version%.pkg"

        /usr/sbin/installer -pkg "$DISPLAYLINK_PKG" -target "$3"
        /usr/sbin/installer -pkg "$DISPLAYLINK_EXTENTION_PKG" -target "$3"

        exit 0

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        id: 'com.displaylink.displaylinkmanagerapp'
        version: '%version%'
        options: purge_ds_store
        pkgname: '%SOFTWARE_TITLE%-%version%'
        pkgdir: '%RECIPE_CACHE_DIR%'
        scripts: '%RECIPE_CACHE_DIR%/pkgroot/scripts'
        pkgroot: '%RECIPE_CACHE_DIR%/pkgroot/payload'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/pkgroot'
        - '%RECIPE_CACHE_DIR%/extractedfile'
