---
Description: ''
Identifier: com.github.smithjw-actions.download.Self_Service
MinimumVersion: '2.9'

Input:
  NAME: ''
  SOFTWARE_TITLE: ''
  DOWNLOAD_URL: ''
  DOWNLOAD_MISSING_FILE:
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED:

Process:
  - Processor: URLDownloaderPython
    Arguments:
      filename: '%SOFTWARE_TITLE%.pkg'
      url: '%DOWNLOAD_URL%'
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'

  - Processor: EndOfCheckPhase
  - Processor: com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged
    Arguments:
      bypass_stop_processing_if: '%BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - ''
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%pathname%'
