---
Description: ''
Identifier: com.github.smithjw-actions.pkg.Jamf_Setup_Manager
ParentRecipe: com.github.smithjw-actions.download.Jamf_Setup_Manager
MinimumVersion: '2.3'

Input:
  NAME: Jamf Setup Manager
  SOFTWARE_TITLE: Jamf_Setup_Manager

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
      source_pkg: '%pathname%'
