---
Description: Downloads the latest version of Visual Studio Code and
  renames the package.
Identifier: com.github.smithjw-actions.pkg.Visual_Studio_Code
ParentRecipe: com.github.smithjw-actions.download.Visual_Studio_Code
MinimumVersion: '2.3'

Input:
  NAME: Visual Studio Code
  SOFTWARE_TITLE: Visual_Studio_Code

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: '0755'
      pkgroot: '%RECIPE_CACHE_DIR%/payload'

  - Processor: FileMover
    Arguments:
      source: '%RECIPE_CACHE_DIR%/unpack/Visual Studio Code.app'
      target: '%pkgroot%/Applications/Visual Studio Code.app'

  - Processor: Versioner
    Arguments:
      input_plist_path: '%pkgroot%/Applications/Visual Studio Code.app/Contents/Info.plist'

  - Processor: PlistReader
    Arguments:
      info_path: '%pkgroot%/Applications/Visual Studio Code.app/Contents/Info.plist'
      plist_keys:
        CFBundleIdentifier: bundleid
        CFBundleName: app_name

  - Processor: PkgCreator
    Arguments:
      force_pkg_build: true
      pkg_request:
        chown:
          - path: Applications
            user: root
            group: wheel
        id: '%bundleid%'
        options: purge_ds_store
        pkgname: '%SOFTWARE_TITLE%-%version%'
        version: '%version%'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/payload'
