Description: Downloads the current release version of Suitcase Fusion
Identifier: com.github.smithjw-actions.download.Suitcase_Fusion
MinimumVersion: '2.3'

Input:
  NAME: Suitcase Fusion
  SOFTWARE_TITLE: Suitcase_Fusion
  SPARKLE_FEED_URL: https://sparkle.extensis.com/u/ST/EN/suitcase21en.xml
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: null

Process:
  - Processor: SparkleUpdateInfoProvider
    Arguments:
      appcast_url: '%SPARKLE_FEED_URL%'

  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%SOFTWARE_TITLE%.dmg'

  - Processor: EndOfCheckPhase

  - Processor: com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged
    Arguments:
      bypass_stop_processing_if: '%BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%/*.app'
      requirement: identifier "com.extensis.SuitcaseFusion" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = J6MMHGD9D6
