Name: Maccy
Description: Downloads the latest version of Maccy and creates an installer package.
Identifier: com.github.smithjw-actions.pkg.Maccy
ParentRecipe: com.github.smithjw-actions.download.Maccy
MinimumVersion: 2.3
Input:
  NAME: Maccy
  SOFTWARETITLE: Maccy

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: '%RECIPE_CACHE_DIR%/%SOFTWARETITLE%'
      pkgdirs:
        Applications: "0755"

  - Processor: Unarchiver
    Arguments:
      archive_format: zip
      archive_path: '%pathname%'
      destination_path: '%pkgroot%/Applications'
      purge_destination: true

  - Processor: Versioner
    Arguments:
      input_plist_path: '%pkgroot%/Applications/%SOFTWARETITLE%.app/Contents/Info.plist'
      plist_version_key: CFBundleShortVersionString

  - Processor: PkgCreator
    Arguments:
      pkgname: '%SOFTWARETITLE%_%version%'
      pkg_request:
        version: '%version%'
        id: org.p0deje.Maccy
        options: purge_ds_store
        chown:
          - path: Applications
            user: root
            group: wheel

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/%SOFTWARETITLE%'