Name: Maccy
Description: Downloads the latest version of Maccy.
Identifier: com.github.smithjw-actions.download.Maccy
MinimumVersion: '2.3'
Input:
  NAME: Maccy
  SOFTWARETITLE: Maccy

Process:
  - Processor: SparkleUpdateInfoProvider
    Arguments:
      appcast_url: https://raw.githubusercontent.com/p0deje/Maccy/master/appcast.xml

  - Processor: URLDownloaderPython
    Arguments:
      filename: '%SOFTWARETITLE%-%version%.zip'

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: '%pathname%'
      destination_path: '%RECIPE_CACHE_DIR%/%SOFTWARETITLE%'
      purge_destination: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/%SOFTWARETITLE%/Maccy.app'
      requirement: anchor apple generic and identifier "org.p0deje.Maccy" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = MN3X4648SC)