---
Description: ''
Identifier: com.github.smithjw-actions.pkg.Zeplin
ParentRecipe: com.github.smithjw-actions.download.Zeplin
MinimumVersion: '2.3'

Input:
  NAME: Zeplin
  SOFTWARE_TITLE: Zeplin
  
Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: '0755'
      pkgroot: '%RECIPE_CACHE_DIR%/payload'
      
  - Processor: FileMover
    Arguments:
      source: '%RECIPE_CACHE_DIR%/%NAME%/Zeplin.app'
      target: '%pkgroot%/Applications/Zeplin.app'
      
  - Processor: PlistReader
    Arguments:
      info_path: '%pkgroot%/Applications/Zeplin.app/Contents/Info.plist'
      plist_keys:
        CFBundleIdentifier: bundleid
        CFBundleName: app_name
        
  - Processor: PkgCreator
    Arguments:
      force_pkg_build: true
      pkg_request:
        chown:
          - path: Applications
            user: root
            group: wheel
        id: '%bundleid%'
        options: purge_ds_store
        pkgname: '%SOFTWARE_TITLE%-%version%'
        version: '%version%'
        
  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/payload'