Description: Downloads the latest version of Zeplin.
Identifier: com.github.smithjw-actions.download.Zeplin
MinimumVersion: '2.3'

Input:
  NAME: Zeplin
  SOFTWARE_TITLE: '%NAME%'
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: null

Process:
  - Processor: com.github.smithjw-actions.processors/URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      prefetch_filename: true
      url: https://zpl.io/download-mac

  - Processor: EndOfCheckPhase

  - Processor: com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged
    Arguments:
      bypass_stop_processing_if: '%BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: Unarchiver
    Arguments:
      archive_path: '%pathname%'
      destination_path: '%RECIPE_CACHE_DIR%/unpack'
      purge_destination: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/unpack/Zeplin.app'
      requirement: anchor apple generic and identifier "io.zeplin.osx" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "8U3Y4X5WDQ")
