
Description: "Downloads the latest version of Zeplin."
Identifier: com.github.smithjw-actions.pkg.Zeplin
ParentRecipe: com.github.smithjw-actions.download.Zeplin
Input:
  NAME: Zeplin
MinimumVersion: "2.3"
Process:
  - Arguments:
      filename: "%NAME%.zip"
      url: https://zpl.io/download-mac
    Processor: URLDownloaderPython

  - Processor: EndOfCheckPhase

  - Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/%NAME%"
      purge_destination: true
    Processor: Unarchiver

  - Arguments:
      input_path: "%RECIPE_CACHE_DIR%/%NAME%/Zeplin.app"
      requirement: anchor apple generic and identifier "io.zeplin.osx" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "8U3Y4X5WDQ")
    Processor: CodeSignatureVerifier