---
Description: "Download recipe of the Axure RP 9 Trial."
Identifier: com.github.smithjw-actions.download.Axure RP 9-Trial
Input:
  NAME: "AxureRP9-Trial"
MinimumVersion: "2.3"
Process:
  - Processor: URLTextSearcher
    Arguments:
      url: "https://www.axure.com/release-history/rp9"
      re_pattern: "https://axure\\.cachefly\\.net/versions/9.*/AxureRP-Setup-.*\\.dmg"
      result_output_var_name: "url"
  - Processor: URLDownloaderPython
    Arguments:
      filename: "%NAME%.dmg"
  - Processor: EndOfCheckPhase
  - Processor: EndOfCheckPhase
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Axure RP 9.app"
      requirement: 'identifier "com.axure.AxureRP9" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = HUMW6UU796'