Description: Downloads the current release version of CharlesProxy and builds a package.
Identifier: com.github.smithjw-actions.pkg.CharlesProxy
ParentRecipe: com.github.smithjw-actions.download.CharlesProxy
MinimumVersion: '2.3'

Input:
  NAME: CharlesProxy

Process:
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: '%pathname%'

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: '0775'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

  - Processor: Copier
    Arguments:
      destination_path: '%pkgroot%/Applications/Charles.app'
      source_path: '%pathname%/Charles.app'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: com.xk72.Charles
        options: purge_ds_store
        pkgdir: '%RECIPE_CACHE_DIR%'
        pkgname: '%NAME%-%version%'
