Description: Downloads the current release version of CharlesProxy.
Identifier: com.github.smithjw-actions.download.CharlesProxy
MinimumVersion: '2.3'

Input:
  NAME: CharlesProxy
  SOFTWARE_TITLE: '%NAME%'

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: .*
      url: https://www.charlesproxy.com/latest.do

  - Processor: com.github.smithjw-actions.processors/URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      fetch_filename: true
      url: https://www.charlesproxy.com/assets/release/%match%/charles-proxy-%match%.dmg
      User_Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/126.0.0.0 Safari/537.36

  - Processor: EndOfCheckPhase
    Arguments:
      version: '%match%'

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%/*.app'
      requirement: identifier "com.xk72.Charles" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "9A5PCU4FSD"
