Description: Downloads the current release version of CharlesProxy and builds a package.
Identifier: com.github.smithjw-actions.pkg.CharlesProxy
ParentRecipe: com.github.smithjw-actions.download.CharlesProxy
MinimumVersion: '2.9'

Input:
  NAME: CharlesProxy
  SOFTWARE_TITLE: '%NAME%'

Process:
  - Processor: AppPkgCreator
    Arguments:
      app_path: '%pathname%/*.app'
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
