Description: Downloads the current release version of CharlesProxy.
Identifier: com.github.smithjw-actions.download.CharlesProxy
MinimumVersion: '2.9'

Input:
  NAME: CharlesProxy
  SOFTWARE_TITLE: '%NAME%'
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: 'False'
  MAJOR_VERSION: '5'

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: <h4>Version\s+(?P<version>%MAJOR_VERSION%\.\d+\.\d+)(?!b\d+).*?<\/h4>
      url: https://www.charlesproxy.com/documentation/version-history/

  - Processor: URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      fetch_filename: true
      url: https://www.charlesproxy.com/assets/release/%version%/charles-proxy-%version%.dmg
      request_headers:
        user-agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/26.0 Safari/605.1.15

  - Processor: EndOfCheckPhase

  - Processor: StopProcessingIf
    Arguments:
      predicate: 'download_changed == %BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%/*.app'
      requirement: |
        identifier "com.xk72.Charles" and anchor apple generic and
        certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and
        certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and
        certificate leaf[subject.OU] = "9A5PCU4FSD"
