<?xml version="1.0" encoding="UTF-8"?>
<policy>
	<general>
		<name>%POLICY_NAME%</name>
		<enabled>true</enabled>
		<frequency>Ongoing</frequency>
		<trigger_other>%POLICY_CUSTOM_TRIGGER%</trigger_other>
		<category>
			<name>%POLICY_CATEGORY%</name>
		</category>
	</general>
	<scope>
		<all_computers>%POLICY_SCOPE_ALL_COMPUTERS%</all_computers>
		<computer_groups>
			<computer_group>
				<name>%PREEXISTING_GROUP_NAME%</name>
			</computer_group>
		</computer_groups>
	</scope>
	<package_configuration>
		<packages>
			<size>1</size>
			<package>
				<name>%pkg_name%</name>
				<action>Install</action>
			</package>
		</packages>
	</package_configuration>
	<scripts>
		<size>0</size>
	</scripts>
	<self_service>
		<use_for_self_service>%SELF_SERVICE_AVAILABLE%</use_for_self_service>
		<install_button_text>%SELF_SERVICE_INSTALL_BUTTON%</install_button_text>
		<reinstall_button_text>%SELF_SERVICE_REINSTALL_BUTTON%</reinstall_button_text>
		<self_service_display_name>%SELF_SERVICE_DISPLAY_NAME%</self_service_display_name>
		<self_service_categories>
			<category>
				<name>%SELF_SERVICE_CATEGORY%</name>
				<display_in>true</display_in>
				<feature_in>false</feature_in>
			</category>
		</self_service_categories>
		<self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
	</self_service>
	<maintenance>
		<recon>%POLICY_RUN_RECON%</recon>
	</maintenance>
	<files_processes>
		<run_command>%POLICY_RUN_COMMAND%</run_command>
	</files_processes>
</policy>