Description: Downloads the latest version of Royal TSX.
Identifier: com.github.smithjw-actions.download.RoyalTSX
MinimumVersion: '2.3'

Input:
  NAME: Royal TSX

Process:
  - Processor: SparkleUpdateInfoProvider
    Arguments:
      appcast_url: https://royaltsx-v6.royalapps.com/updates_stable

  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      filename: '%NAME%-%version%.dmg'

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%/Royal TSX.app'
      requirement: identifier "com.lemonmojo.RoyalTSX.App" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VXP8K9EDP6
