Description: Downloads the latest version of Royal TSX and creates an installer package.
Identifier: com.github.smithjw-actions.pkg.Royal_TSX
ParentRecipe: com.github.smithjw-actions.download.Royal_TSX
MinimumVersion: '2.9'

Input:
  NAME: Royal TSX
  SOFTWARE_TITLE: Royal_TSX

Process:
  - Processor: AppPkgCreator
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
