Name: Royal TSX
Description: Downloads the latest version of Royal TSX and creates an installer package.
Identifier: com.github.smithjw-actions.pkg.RoyalTSX
ParentRecipe: com.github.smithjw-actions.download.RoyalTSX
MinimumVersion: 2.3
Input:
  NAME: Royal TSX
  BUNDLE_ID: com.lemonmojo.RoyalTSX.App

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: %RECIPE_CACHE_DIR%/%NAME%
      pkgdirs:
        Applications: "0755"

  - Processor: Copier
    Arguments:
      source_path: %RECIPE_CACHE_DIR%/%NAME%/Royal TSX.app
      destination_path: %pkgroot%/Applications/Royal TSX.app

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: %NAME%-%version%
        pkgdir: %RECIPE_CACHE_DIR%
        id: %BUNDLE_ID%
        options: purge_ds_store
        chown:
          - path: Applications
            user: root
            group: admin

  - Processor: PathDeleter
    Arguments:
      path_list:
        - %RECIPE_CACHE_DIR%/%NAME%  # Clean up temporary files