Description: Downloads the current version of the individual Office-Reset package of your choice, renames it, then uploads to Jamf Pro.
Comment: |
  By default, this recipe is set to download the reset package for the complete Microsoft Office suite. Valid options for SOFTWARE_TITLE are as follows:
    - Office_Factory
    - Word
    - Excel
    - PowerPoint
    - Outlook
    - OneNote
    - OneDrive
    - Teams
    - License
    - AutoUpdate
Identifier: com.github.smithjw-actions.jamf.Office_Reset
ParentRecipe: com.github.smithjw-actions.pkg.Office_Reset
MinimumVersion: '2.3'

Input:
  NAME: Office Reset
  SOFTWARE_TITLE: Office_Reset
  SEARCH_TITLE: Office_Factory
  CATEGORY: Apps
  POLICY_CATEGORY: Apps
  POLICY_CUSTOM_TRIGGER: install-%SOFTWARE_TITLE%
  POLICY_NAME: '%NAME%'
  POLICY_RUN_COMMAND: ' '
  POLICY_RUN_RECON: 'false'
  POLICY_SCOPE_ALL_COMPUTERS: 'true'
  POLICY_TEMPLATE: Policy_Template-Self_Service.xml
  REMOVE_OLD_PACKAGES: 'true'
  SELF_SERVICE_AVAILABLE: 'true'
  SELF_SERVICE_CATEGORY: Design
  SELF_SERVICE_DESCRIPTION: |
    The Office Reset - %SEARCH_TITLE% policy will revert %SEARCH_TITLE% back to its
    original state leving behind only the application's app bundle. This will remove:

    - All user-preferences

    - Group/per-app containers

    - Temporary caches

    - Heychain entries

    - Mailbox content (Office & Outlook Office-Reset packages)"
  SELF_SERVICE_DISPLAY_NAME: '%NAME% - %SEARCH_TITLE%'
  SELF_SERVICE_ICON: '%SOFTWARE_TITLE%_%SOFTWARE_TITLE%.png'
  SELF_SERVICE_INSTALL_BUTTON: Install
  SELF_SERVICE_REINSTALL_BUTTON: Reinstall
  REPLACE_POLICY: 'true'
  PACKAGE_INFO: autopkg
  UPDATE_PREDICATE: 'pkg_uploaded == False'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      pkg_info: '%PACKAGE_INFO%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      icon: '%SELF_SERVICE_ICON%'
      policy_name: '%POLICY_NAME%'
      policy_template: '%POLICY_TEMPLATE%'
      replace_policy: '%REPLACE_POLICY%'

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%REMOVE_OLD_PACKAGES% == false'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: '%SOFTWARE_TITLE%-'
      versions_to_keep: 2
