Description: Downloads the latest version of Talon Voice and creates an installer package.
Identifier: com.github.smithjw-actions.pkg.Talon_Voice
ParentRecipe: com.github.smithjw-actions.download.Talon_Voice
MinimumVersion: '2.3'

Input:
  NAME: Talon Voice
  SOFTWARE_TITLE: Talon_Voice

Process:
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: '%pathname%'

  - Processor: AppPkgCreator
    Arguments:
      app_path: '%pathname%/Talon.app'
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
