Name: MacPass
Description: Downloads the current release version of MacPass.
Identifier: com.github.smithjw-actions.download.MacPass
MinimumVersion: 2.3
Input:
  NAME: MacPass

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: MacPass/MacPass
      asset_regex: (MacPass-[\d\.]+\.zip)

  - Processor: URLDownloaderPython

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: %pathname%
      destination_path: %RECIPE_CACHE_DIR%/%NAME%
      purge_destination: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: %RECIPE_CACHE_DIR%/%NAME%/MacPass.app
      requirement: anchor apple generic and identifier "com.hicknhacksoftware.MacPass" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "55SM4L4Z97"