Name: MacPass
Description: Downloads the latest release version of MacPass and creates an installer package.
Identifier: com.github.smithjw-actions.pkg.MacPass
ParentRecipe: com.github.smithjw-actions.download.MacPass
MinimumVersion: 2.3
Input:
  NAME: MacPass
  BUNDLE_ID: com.hicknhacksoftware.MacPass

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: %RECIPE_CACHE_DIR%/%NAME%
      pkgdirs:
        Applications: "0755"

  - Processor: Copier
    Arguments:
      source_path: %RECIPE_CACHE_DIR%/%NAME%/MacPass.app
      destination_path: %pkgroot%/Applications/MacPass.app

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: %NAME%-%version%
        pkgdir: %RECIPE_CACHE_DIR%
        id: %BUNDLE_ID%
        options: purge_ds_store
        chown:
          - path: Applications
            user: root
            group: admin