Description: Downloads the latest version of MacPass and creates an installer package.
Identifier: com.github.smithjw-actions.pkg.MacPass
ParentRecipe: com.github.smithjw-actions.download.MacPass
MinimumVersion: '2.3'

Input:
  NAME: MacPass
  SOFTWARE_TITLE: '%NAME%'

Process:
  - Processor: AppPkgCreator
    Arguments:
      app_path: '%RECIPE_CACHE_DIR%/unpack/MacPass.app'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
