Description: Downloads the latest version of MacPass and creates an installer package.
Identifier: com.github.smithjw-actions.pkg.MacPass
ParentRecipe: com.github.smithjw-actions.download.MacPass
MinimumVersion: '2.3'

Input:
  NAME: MacPass
  SOFTWARETITLE: MacPass

Process:
  - Processor: AppPkgCreator
    Arguments:
      app_path: '%RECIPE_CACHE_DIR%/%NAME%/MacPass.app'
