Description: Tableau Desktop empowers users to create, analyze, and visualize data with interactive dashboards and reports, making data-driven decision-making easy.
Identifier: com.github.smithjw-actions.jamf.upload.Tableau_Desktop
ParentRecipe: com.github.smithjw-actions.pkg.Tableau_Desktop
MinimumVersion: '2.9'

Input:
  NAME: Tableau Desktop
  SOFTWARE_TITLE: Tableau_Desktop
  CATEGORY: Apps
  REMOVE_OLD_PACKAGES: 'true'
  PACKAGE_INFO: autopkg
  PKG_TO_KEEP: '2'
  PKG_NAME_MATCH: '%SOFTWARE_TITLE%-'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      pkg_info: '%PACKAGE_INFO%'

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%REMOVE_OLD_PACKAGES% == false'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: '%PKG_NAME_MATCH%'
      versions_to_keep: '%PKG_TO_KEEP%'
