Description: Downloads latest Tableau Desktop disk images for both Intel and ARM architectures.
Identifier: com.github.smithjw-actions.download.Tableau_Desktop
MinimumVersion: '2.3'

Input:
  NAME: Tableau Desktop
  SOFTWARE_TITLE: Tableau_Desktop
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: null
  DOWNLOAD_MISSING_FILE: null

Process:
  - Processor: com.github.smithjw-actions.processors/URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%SOFTWARE_TITLE%-x86_64.dmg'
      url: https://www.tableau.com/downloads/desktop/mac

  - Processor: com.github.smithjw-actions.processors/URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%SOFTWARE_TITLE%-arm64.dmg'
      url: https://www.tableau.com/downloads/desktop/reg-mac-arm64

  - Processor: EndOfCheckPhase

  - Processor: com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged
    Arguments:
      bypass_stop_processing_if: '%BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: Tableau Software, LLC (QJ4XPRK37C)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%-x86_64.dmg/Tableau Desktop.pkg'

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: Tableau Software, LLC (QJ4XPRK37C)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%-arm64.dmg/Tableau.pkg'
