Description: Downloads the latest VLC universal.
Identifier: com.github.smithjw-actions.download.VLC
MinimumVersion: '2.9'

Input:
  NAME: VLC
  SOFTWARE_TITLE: '%NAME%'
  DOWNLOAD_PATTERN: get.videolan.org/vlc/[0-9]+\.[0-9]+\.[0-9]+/macosx/vlc-[0-9]+\.[0-9]+\.[0-9]+-universal.dmg
  SEARCH_URL: https://www.videolan.org/vlc/download-macosx.html
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: 'False'

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '%DOWNLOAD_PATTERN%'
      url: '%SEARCH_URL%'

  - Processor: URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%NAME%.dmg'
      url: 'https://%match%'

  - Processor: EndOfCheckPhase

  - Processor: StopProcessingIf
    Arguments:
      predicate: 'download_changed == %BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%/VLC.app'
      requirement: identifier "org.videolan.vlc" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "75GAHG3SZQ"
