Description: Downloads the latest VLC disk image and builds a package.
Identifier: com.github.smithjw-actions.pkg.VLC
ParentRecipe: com.github.smithjw-actions.download.VLC
MinimumVersion: '2.9'

Input:
  NAME: VLC
  SOFTWARE_TITLE: '%NAME%'

Process:
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: '%pathname%'

  - Processor: AppPkgCreator
    Arguments:
      app_path: '%pathname%/VLC.app'
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
