Description: Downloads and extracts the Poly Lens .pkg from the DMG
Identifier: com.github.smithjw-actions.pkg.Poly_Lens_Desktop
ParentRecipe: com.github.smithjw-actions.download.Poly_Lens_Desktop
MinimumVersion: '2.3'

Input:
  NAME: Poly Lens Desktop
  SOFTWARE_TITLE: Poly_Lens_Desktop

Process:
  - Processor: PkgCopier
    Arguments:
      source_pkg: '%pathname%/*.pkg'
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
