Description: Downloads the latest Poly Lens macOS .dmg
Identifier: com.github.smithjw-actions.download.Poly_Lens_Desktop
MinimumVersion: '2.3'

Input:
  NAME: Poly Lens Desktop
  SOFTWARE_TITLE: Poly_Lens_Desktop
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: null

Process:
  - Processor: FindLatestPolyLensURL

  - Processor: com.github.smithjw-actions.processors/URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%SOFTWARE_TITLE%.dmg'
      url: '%download_url%'

  - Processor: EndOfCheckPhase
  - Processor: com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged
    Arguments:
      bypass_stop_processing_if: '%BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%/*.pkg'
      expected_authority_names:
        - 'Developer ID Installer: Polycom (WJCM3F7AQ4)'
        - 'Developer ID Certification Authority'
        - 'Apple Root CA'
