---
Description: Downloads the latest version of Colour Contrast Analyser.
Identifier: com.github.smithjw-actions.download.ColourContrastAnalyser
MinimumVersion: '2.3'
Input:
  NAME: ColourContrastAnalyser

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      asset_regex: .*.dmg
      github_repo: ThePacielloGroup/CCAe

  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      filename: '%NAME%.dmg'

  - Processor: EndOfCheckPhase
