Name: ColourContrastAnalyser
Description: Downloads the latest version of Colour Contrast Analyser and builds a package.
Identifier: com.github.smithjw-actions.pkg.ColourContrastAnalyser
ParentRecipe: com.github.smithjw-actions.download.ColourContrastAnalyser
MinimumVersion: '2.3'
Input:
  NAME: ColourContrastAnalyser

Process:
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: '%pathname%'

  - Processor: PkgRootCreator
    Arguments:
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'
      pkgdirs:
        Applications: "0775"

  - Processor: Copier
    Arguments:
      source_path: '%pathname%/ColourContrastAnalyser.app'
      destination_path: '%pkgroot%/Applications/ColourContrastAnalyser.app'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: '%NAME%-%version%'
        pkgdir: '%RECIPE_CACHE_DIR%'
        id: com.github.smithjw-actions.ColourContrastAnalyser
        options: purge_ds_store
        chown:
          - path: Applications
            user: root
            group: admin