Description: Downloads latest Tableau Desktop disk image.
Identifier: com.github.smithjw-actions.download.Tableau-Desktop
Input:
  DOWNLOAD_URL: https://www.tableau.com/downloads/desktop/mac
  NAME: TableauDesktop
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: null

MinimumVersion: '2.3.0'
Process:
  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%.dmg"
      url: "%DOWNLOAD_URL%"
  - Processor: EndOfCheckPhase
  - Processor: com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged
    Arguments:
      bypass_stop_processing_if: '%BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'
  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - "Developer ID Installer: Tableau Software, LLC (QJ4XPRK37C)"
        - "Developer ID Certification Authority"
        - "Apple Root CA"
      input_path: "%pathname%/Tableau Desktop.pkg"
