Description: Downloads latest Tableau Desktop disk image and makes a pkg.
Identifier: com.github.smithjw-actions.pkg.Tableau-Desktop
Input:
  NAME: TableauDesktop
MinimumVersion: 2.3.0
ParentRecipe: com.github.smithjw-actions.download.Tableau-Desktop
Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      flat_pkg_path: "%pathname%/Tableau Desktop.pkg"
      purge_destination: true

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/payload"
      pkg_payload_path: "%RECIPE_CACHE_DIR%/unpack/Tableau App.pkg/payload"
      purge_destination: true

  - Processor: PlistReader
    Arguments:
      info_path: "%RECIPE_CACHE_DIR%/payload"
      plist_keys:
        CFBundleShortVersionString: version

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/Tableau Desktop-%version%.pkg"
      source_pkg: "%pathname%/Tableau Desktop.pkg"
