Description: |
  Downloads the most recent signed release pkg of macadmins/python from GitHub.

  In order to get the latest pre-release, set the Input variable INCLUDE_PRERELEASES to a non-empty
  string (such as 'True'; this is the default). If you just want the latest full release instead,
  INCLUDE_PRERELEASES must be set to an empty string.
Identifier: com.github.smithjw-actions.download.Mac_Admins_Python
MinimumVersion: '2.3'

Input:
  NAME: Mac Admins Python
  SOFTWARE_TITLE: Mac_Admins_Python
  INCLUDE_PRERELEASES: 'True'
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: null

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      asset_regex: python_recommended_signed-[\d.]+.pkg
      github_repo: macadmins/python
      include_prereleases: '%INCLUDE_PRERELEASES%'

  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%SOFTWARE_TITLE%.pkg'

  - Processor: EndOfCheckPhase

  - Processor: com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged
    Arguments:
      bypass_stop_processing_if: '%BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: Mac Admins Open Source (T4SK8ZXCXG)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%pathname%'
