Description: Downloads the most recent signed release pkg of Mac Admins Python from GitHub and renames the package.
Identifier: com.github.smithjw-actions.pkg.Mac_Admins_Python
ParentRecipe: com.github.smithjw-actions.download.Mac_Admins_Python
MinimumVersion: '2.3'

Input:
  NAME: Mac Admins Python
  SOFTWARE_TITLE: Mac_Admins_Python

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
      source_pkg: '%pathname%'
