Description: Downloads the FreeLens PKG from GitHub releases.
Identifier: com.github.smithjw-actions.pkg.FreeLens
ParentRecipe: com.github.smithjw-actions.download.FreeLens
MinimumVersion: '2.3'

Input:
  NAME: FreeLens
  SOFTWARE_TITLE: '%NAME%'

Process:
  - Processor: PkgCopier
    Arguments:
      source_pkg: '%pathname%'
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'