Description: Downloads the latest Freelens release packages from GitHub.
Identifier: com.github.smithjw-actions.download.Freelens
MinimumVersion: '2.6'

Input:
  NAME: Freelens
  SOFTWARE_TITLE: Freelens
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: 'False'

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      asset_regex: .*macos-arm64\.pkg$
      github_repo: freelensapp/freelens

  - Processor: com.github.smithjw-actions.processors/URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%SOFTWARE_TITLE%-arm64.pkg'

  - Processor: GitHubReleasesInfoProvider
    Arguments:
      asset_regex: .*macos-amd64\.pkg$
      github_repo: freelensapp/freelens

  - Processor: com.github.smithjw-actions.processors/URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%SOFTWARE_TITLE%-x86_64.pkg'

  - Processor: EndOfCheckPhase

  - Processor: StopProcessingIf
    Arguments:
      predicate: 'download_changed == %BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: ROBERTO BANDINI (TFR6NT55MB)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%-arm64.pkg'

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: ROBERTO BANDINI (TFR6NT55MB)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%-x86_64.pkg'
