Description: Downloads the latest version of FreeLens, creates a package, then uploads to Jamf
Identifier: com.github.smithjw-actions.jamf.FreeLens
ParentRecipe: com.github.smithjw-actions.pkg.FreeLens
MinimumVersion: '2.3'

Input:
  NAME: FreeLens
  SOFTWARE_TITLE: '%NAME%'
  CATEGORY: Engineering
  POLICY_CATEGORY: '%CATEGORY%'
  POLICY_CUSTOM_TRIGGER: install-%SOFTWARE_TITLE%
  POLICY_NAME: '%NAME%'
  POLICY_RUN_COMMAND: ' '
  POLICY_RUN_RECON: 'false'
  POLICY_SCOPE_ALL_COMPUTERS: 'true'
  POLICY_TEMPLATE: Policy_Template-Self_Service.xml
  REMOVE_OLD_PACKAGES: 'true'
  SELF_SERVICE_AVAILABLE: 'true'
  SELF_SERVICE_CATEGORY: Engineering
  SELF_SERVICE_DESCRIPTION: |
    FreeLens is a free and open-source Kubernetes IDE that provides a user-friendly interface for managing Kubernetes clusters.

    Key Features:
    • Real-time cluster monitoring and management
    • Built-in terminal with kubectl integration
    • Pod logs and resource inspection
    • YAML editor with validation
    • Multi-cluster support
    • Extension ecosystem for customization

    FreeLens is a fork of OpenLens designed to remain free and open-source for the Kubernetes community.
  SELF_SERVICE_DISPLAY_NAME: '%NAME%'
  SELF_SERVICE_ICON: '%SOFTWARE_TITLE%.png'
  SELF_SERVICE_INSTALL_BUTTON: Install
  SELF_SERVICE_REINSTALL_BUTTON: Reinstall
  REPLACE_POLICY: 'true'
  PACKAGE_INFO: autopkg

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      pkg_info: '%PACKAGE_INFO%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_name: '%POLICY_NAME%'
      policy_template: '%POLICY_TEMPLATE%'
      replace_policy: '%REPLACE_POLICY%'

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%REMOVE_OLD_PACKAGES% == false'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: '%SOFTWARE_TITLE%-'
      versions_to_keep: 2
