Description: Downloads the latest FreeLens (ARM64) PKG from GitHub releases.
Identifier: com.github.smithjw-actions.download.FreeLens
MinimumVersion: '2.3'

Input:
  NAME: FreeLens
  SOFTWARE_TITLE: '%NAME%'
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: 'False'

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      asset_regex: .*macos-arm64\.pkg$
      github_repo: freelensapp/freelens

  - Processor: com.github.smithjw-actions.processors/URLDownloader
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%SOFTWARE_TITLE%.pkg'

  - Processor: EndOfCheckPhase

  - Processor: StopProcessingIf
    Arguments:
      predicate: 'download_changed == %BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'ROBERTO BANDINI (TFR6NT55MB)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%pathname%'
