Description: ''
Identifier: com.github.smithjw-actions.jamf.upload.Azul_Zulu_JDK
ParentRecipe: com.github.smithjw-actions.pkg.Azul_Zulu_JDK
MinimumVersion: '2.9'

Input:
  NAME: Azul Zulu JDK
  SOFTWARE_TITLE: Azul_Zulu_JDK
  CATEGORY: Apps
  JDK_VERSION: '24'
  REMOVE_OLD_PACKAGES: 'true'
  PACKAGE_INFO: autopkg
  PKG_TO_KEEP: '2'
  PKG_NAME_MATCH: '%SOFTWARE_TITLE%-%JDK_VERSION%'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      pkg_info: '%PACKAGE_INFO%'

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%REMOVE_OLD_PACKAGES% == false'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: '%PKG_NAME_MATCH%'
      versions_to_keep: '%PKG_TO_KEEP%'
