Description: |
  Downloads the latest release version of Azul Zulu Java for given
  Java version, architecture, bundle type (JDK/JRE), and file
  extension.
  Architectures: arm
Identifier: com.github.smithjw-actions.pkg.AzulZuluJava_22
ParentRecipe: com.github.smithjw-actions.download.AzulZuluJava_22
MinimumVersion: '2.3'

Input:
  BUNDLE_TYPE: jdk
  DOWNLOAD_FILE_EXTENSION: dmg
  ARCHITECTURE: arm
  JAVA_MAJOR_VERSION: '22'
  NAME: AzulZuluJava

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%_%JAVA_MAJOR_VERSION%_%openjdk_build_number%_%BUNDLE_TYPE%_%ARCHITECTURE%-%version%.pkg'
      source_pkg: '%pathname%/*.pkg'

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: Azul Systems, Inc. (TDTHCUPYFR)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%pkg_path%'
