Description: ''
Identifier: com.github.smithjw-actions.download.Azul_Zulu_JDK_11
MinimumVersion: '2.3'

Input:
  NAME: AzulZuluJava
  JAVA_MAJOR_VERSION: '11'
  ARCHITECTURE: arm
  DOWNLOAD_FILE_EXTENSION: dmg
  BUNDLE_TYPE: jdk
  SOFTWARE_TITLE:
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: null

Process:
  - Processor: AzulZuluJavaInfoProvider
    Arguments:
      arch: '%ARCHITECTURE%'
      bundle_type: '%BUNDLE_TYPE%'
      extension: '%DOWNLOAD_FILE_EXTENSION%'
      java_major_version: '%JAVA_MAJOR_VERSION%'

  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      CHECK_FILESIZE_ONLY: true

  - Processor: EndOfCheckPhase
