Description: |
  Downloads the latest release version of Azul Zulu Java for given
  Java version, architecture, bundle type (JDK/JRE), and file
  extension.
  Architectures: x86, arm
  Extensions: zip, tar.gz, dmg
  Bundle Types: jre, jdk, jre_fx, jdk_fx
Identifier: com.github.smithjw-actions.download.Azul_Zulu_JDK_8
MinimumVersion: '2.3'

Input:
  BUNDLE_TYPE: jdk
  DOWNLOAD_FILE_EXTENSION: dmg
  ARCHITECTURE: arm
  JAVA_MAJOR_VERSION: '8'
  NAME: AzulZuluJava
  SOFTWARE_TITLE:
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: null

Process:
  - Processor: AzulZuluJavaInfoProvider
    Arguments:
      arch: '%ARCHITECTURE%'
      bundle_type: '%BUNDLE_TYPE%'
      extension: '%DOWNLOAD_FILE_EXTENSION%'
      java_major_version: '%JAVA_MAJOR_VERSION%'

  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      CHECK_FILESIZE_ONLY: true

  - Processor: EndOfCheckPhase
