Description: ''
Identifier: com.github.smithjw-actions.pkg.Azul_Zulu_JDK_17
ParentRecipe: com.github.smithjw-actions.download.Azul_Zulu_JDK_17
MinimumVersion: '2.3'

Input:
  NAME: AzulZuluJava
  JAVA_MAJOR_VERSION: '17'
  ARCHITECTURE: arm
  DOWNLOAD_FILE_EXTENSION: dmg
  BUNDLE_TYPE: jdk

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%_%JAVA_MAJOR_VERSION%_%openjdk_build_number%_%BUNDLE_TYPE%_%ARCHITECTURE%-%version%.pkg'
      source_pkg: '%pathname%/*.pkg'

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: Azul Systems, Inc. (TDTHCUPYFR)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%pkg_path%'
