Description: |
  Downloads the latest verison of Logitech Options Plus Offline installer and creates a package.
  https://prosupport.logi.com/hc/en-gb/articles/6046882446359-Mass-installation-and-configuration-of-Logitech-Options-software#h.k97ihcogiap9
Identifier: com.github.smithjw-actions.pkg.logi_options_plus
ParentRecipe: com.github.smithjw-actions.download.logi_options_plus
MinimumVersion: '2.9'

Input:
  NAME: Logi Options+
  SOFTWARE_TITLE: logi_options_plus

Process:
  - Processor: PlistReader
    Arguments:
      info_path: '%found_filename%/Contents/Info.plist'
      plist_keys:
        CFBundleVersion: version
        CFBundleIdentifier: bundleid
        CFBundleName: app_name

  - Processor: PkgRootCreator
    Arguments:
      pkgroot: '%RECIPE_CACHE_DIR%/payload'
      pkgdirs:
        pkgroot: '0775'
        scripts: '0775'

  - Processor: Copier
    Arguments:
      source_path: '%found_filename%'
      destination_path: '%RECIPE_CACHE_DIR%/payload/scripts/%found_basename%'

  - Processor: FileCreator
    Arguments:
      file_content: |
        #!/bin/bash
        # Determine working directory
        installDir=$(dirname $0)
        installApp=("${installDir}"/*\.app)

        "$installApp"/Contents/MacOS/logioptionsplus_installer \
          --quiet \
          --analytics no \
          --flow no \
          --sso no \
          --update no \
          --aipromptbuilder no \
          --device-recommendation no \
          --smartactions no \
          --actions-ring no

        exitcode=$?
        exit "${exitcode}"

      file_mode: '0755'
      file_path: '%RECIPE_CACHE_DIR%/payload/scripts/postinstall'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        id: '%bundleid%'
        options: purge_ds_store
        pkgdir: '%RECIPE_CACHE_DIR%'
        pkgname: '%SOFTWARE_TITLE%-%version%'
        pkgroot: '%RECIPE_CACHE_DIR%/payload/pkgroot'
        scripts: '%RECIPE_CACHE_DIR%/payload/scripts'
        version: '%version%'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/payload'
