Description: Downloads the current version of pgAdmin 4.
Identifier: com.github.smithjw-actions.download.pgAdmin4
MinimumVersion: '2.3'
Input:
  NAME: pgAdmin4
  ARCH: arm64
  DOWNLOAD_URL: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: null

Process:
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.pgadmin.org/download/pgadmin-4-macos/
      re_pattern: 'href="(https://www\.postgresql\.org/ftp/pgadmin/pgadmin4/v[0-9\.]+/macos/)"'
      result_output_var_name: postgresql_url

  - Processor: URLTextSearcher
    Arguments:
      url: "%postgresql_url%"
      re_pattern: 'href="(https://ftp\.postgresql\.org/pub/pgadmin/pgadmin4/v[0-9\.]+/macos/pgadmin4-[0-9\.]+-%ARCH%\.dmg)"'
      result_output_var_name: download_url

  - Processor: URLDownloader
    Arguments:
      url: "%download_url%"
      CHECK_FILESIZE_ONLY: true

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/pgAdmin 4.app"
      requirement: |
        identifier "org.pgadmin.pgadmin4" and anchor apple generic and
        certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and
        certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and
        certificate leaf[subject.OU] = TCHGL2R7C5
