Description: ''
Identifier: com.github.smithjw-actions.pkg.Karabiner_Elements
ParentRecipe: com.github.smithjw-actions.download.Karabiner_Elements
MinimumVersion: '2.3'

Input:
  NAME: Karabiner-Elements
  SOFTWARE_TITLE: Karabiner_Elements

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
      source_pkg: '%pathname%/Karabiner-Elements.pkg'
