Description: |
  Downloads and installs the latest version of Oracle Java 17 JDK.
Identifier: com.github.smithjw-actions.pkg.JavaJDK17
ParentRecipe: com.github.smithjw-actions.download.JavaJDK17
MinimumVersion: '2.3'

Input:
  SOFTWARETYPE: JDK
  SOFTWARETITLE: Java
  VENDOR: Oracle
  NAME: Oracle Java 17 JDK

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: (?P<url>https://download.oracle.com/otn/java/jdk/.*?/jdk-17.*?macOS-x64_bin.dmg)
      url: https://www.oracle.com/java/technologies/javase-jdk17-downloads.html

  - Processor: URLDownloaderPython
    Arguments:
      filename: '%NAME%.dmg'
      request_headers:
        Cookie: oraclelicense=accept-securebackup-cookie

  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/downloads/unpack'
      flat_pkg_path: '%RECIPE_CACHE_DIR%/%NAME%.dmg'

  - Processor: FileFinder
    Arguments:
      pattern: '%RECIPE_CACHE_DIR%/downloads/unpack/jdk*.pkg'

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/downloads/payload'
      pkg_payload_path: '%found_filename%/Payload'

  - Processor: Versioner
    Arguments:
      input_plist_path: '%RECIPE_CACHE_DIR%/downloads/payload/Contents/Info.plist'
      plist_version_key: CFBundleVersion

  - Processor: PkgCopier
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%VENDOR%_%SOFTWARETITLE%_%SOFTWARETYPE%_%version%.pkg'
      source_pkg: '%RECIPE_CACHE_DIR%/downloads/unpack/*.pkg'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/downloads/unpack'
        - '%RECIPE_CACHE_DIR%/downloads/payload'
