Description: Packages and uploads Oracle Instant Client Basic for macOS ARM64 to Jamf Pro (package upload only).
Identifier: com.github.smithjw-actions.jamf.upload.Oracle_Instant_Client
ParentRecipe: com.github.smithjw-actions.pkg.Oracle_Instant_Client
MinimumVersion: '2.3'

Input:
  NAME: Oracle Instant Client
  SOFTWARE_TITLE: Oracle_Instant_Client
  CATEGORY: Apps
  PACKAGE_INFO: autopkg
  PKG_TO_KEEP: '2'
  PKG_NAME_MATCH: '%SOFTWARE_TITLE%-'
  REMOVE_OLD_PACKAGES: 'true'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      pkg_info: '%PACKAGE_INFO%'

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%REMOVE_OLD_PACKAGES% == false'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: '%PKG_NAME_MATCH%'
      versions_to_keep: '%PKG_TO_KEEP%'
