Description: |
  Downloads the latest version of Oracle Java 21 JDK.
Identifier: com.github.smithjw-actions.download.JavaJDK21
MinimumVersion: '2.3'

Input:
  SOFTWARETYPE: JDK
  SOFTWARETITLE: Java
  VENDOR: Oracle
  NAME: Oracle Java 21 JDK

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: (?P<url>https://download.oracle.com/otn/java/jdk/.*?/jdk-21.*?macOS-x64_bin.dmg)
      url: https://www.oracle.com/java/technologies/javase-jdk21-downloads.html

  - Processor: URLDownloaderPython
    Arguments:
      filename: '%NAME%.dmg'
      request_headers:
        Cookie: oraclelicense=accept-securebackup-cookie
