Description: Downloads the latest version of SQL Developer and creates an installer package.
Identifier: com.github.smithjw-actions.pkg.SQLDeveloper
ParentRecipe: /Users/james.smith/code/smithjw/smithjw-actions-recipes/Oracle/SQLDeveloper.download.recipe.yaml #com.github.smithjw-actions.download.SQLDeveloper
MinimumVersion: '2.3'

Input:
  NAME: SQLDeveloper
  SOFTWARE_TITLE: SQLDeveloper
  BUNDLE_ID: com.oracle.SQLDeveloper

Process:
  - Processor: AppPkgCreator
    Arguments:
      app_path: '%RECIPE_CACHE_DIR%/unpack/*.app'
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
