Description: Downloads the latest version of Stream Deck and creates a package.
Identifier: com.github.smithjw-actions.pkg.StreamDeck
ParentRecipe: com.github.smithjw-actions.download.StreamDeck
MinimumVersion: '2.3'

Input:
  BUNDLE_ID: org.elgato.StreamDeck.package
  NAME: StreamDeck

Process:
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: '%RECIPE_CACHE_DIR%/installer_payload/Stream_Deck.pkg'

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: '0775'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

  - Processor: Copier
    Arguments:
      destination_path: '%pkgroot%/Applications/StreamDeck.app'
      source_path: '%RECIPE_CACHE_DIR%/installer_payload/Stream_Deck.pkg/Applications/StreamDeck.app'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: '%BUNDLE_ID%'
        options: purge_ds_store
        pkgdir: '%RECIPE_CACHE_DIR%'
        pkgname: '%NAME%-%version%'
