Description: Downloads the latest version of Nexthink Collector dmg
Identifier: com.github.smithjw-actions.download.Nexthink_Collector
MinimumVersion: '2.9'

Input:
  NAME: Nexthink Collector
  SOFTWARE_TITLE: Nexthink_Collector
  DOWNLOAD_URL: https://download.nexthink.com/releases/latest/OSX_Collector/Nexthink_Collector.dmg
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: 'False'

Process:
  - Processor: URLDownloaderPython
    Arguments:
      filename: '%SOFTWARE_TITLE%.dmg'
      url: '%DOWNLOAD_URL%'

  - Processor: EndOfCheckPhase

  - Processor: StopProcessingIf
    Arguments:
      predicate: 'download_changed == %BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%/csi.app'
      requirement: |
        identifier "com.nexthink.collector.installer.csi" and
        anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] and
        certificate leaf[field.1.2.840.113635.100.6.1.13] and
        certificate leaf[subject.OU] = PDEKAZ43QL
