Description: Packages Nexthink CSI
Identifier: com.github.smithjw-actions.pkg.NexThinkCollector
ParentRecipe: com.github.smithjw-actions.download.NexThinkCollector
MinimumVersion: '2.3'

Input:
  NAME: Nexthink Collector
  SOFTWARE_TITLE: NexthinkCollector

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
      pkgdirs:
        private/var/tmp/Nexthink: '0775'

  - Processor: Copier
    Arguments:
      source_path: '%pathname%/csi.app'
      destination_path: '%RECIPE_CACHE_DIR%/pkgroot/private/var/tmp/Nexthink/csi.app'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        id: com.nexthink.csi
        version: '%version%'
        install_location: '/'
        options: purge_ds_store
        pkgname: '%SOFTWARE_TITLE%-%version%'
        pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
        chown:
        - path: private/var/tmp/Nexthink
          user: root
          group: wheel
          mode: '0755'
