Description: Downloads and extracts Nexthink Collector (csi.app), for distribution via Jamf into /private/var/tmp/Nexthink on managed devices
Identifier: com.github.smithjw-actions.jamf.Nexthink_Collector
ParentRecipe: com.github.smithjw-actions.pkg.Nexthink_Collector
MinimumVersion: '2.3'

Input:
  NAME: Nexthink Collector
  SOFTWARE_TITLE: Nexthink_Collector
  CATEGORY: Apps
  REMOVE_OLD_PACKAGES: 'true'
  PACKAGE_INFO: autopkg
  VERSIONS_TO_KEEP: 2

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      pkg_info: '%PACKAGE_INFO%'

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%REMOVE_OLD_PACKAGES% == false'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: '%SOFTWARE_TITLE%-'
      versions_to_keep: '%VERSIONS_TO_KEEP%'
