Name: HandBrake
Description: Uploads the latest HandBrake disk image to Jamf and creates a Smart Group and Policy.
Identifier: com.github.smithjw-actions.jamf.HandBrake
MinimumVersion: 2.3
Input:
  CATEGORY: Digital Media
  GROUP_NAME: HandBrake-update-smart
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  NAME: HandBrake
  POLICY_CATEGORY: Testing
  POLICY_NAME: Install Latest %NAME%
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  SELF_SERVICE_DESCRIPTION: HandBrake is a tool for converting video from nearly any format to a selection of modern, widely supported codecs.
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_ICON: %NAME%.png
  TESTING_GROUP_NAME: Testing
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: %CATEGORY%

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: %POLICY_CATEGORY%

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: %CATEGORY%

  - Processor: StopProcessingIf
    Arguments:
      predicate: %UPDATE_PREDICATE%

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: %GROUP_NAME%
      computergroup_template: %GROUP_TEMPLATE%
      replace_group: true

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      icon: %SELF_SERVICE_ICON%
      policy_name: %POLICY_NAME%
      policy_template: %POLICY_TEMPLATE%
      replace_policy: true