Description: Downloads the latest Handbrake disk image and creates a package.
Identifier: com.github.smithjw-actions.pkg.HandBrake
ParentRecipe: com.github.smithjw-actions.download.HandBrake
MinimumVersion: '2.9'

Input:
  NAME: HandBrake
  SOFTWARE_TITLE: '%NAME%'

Process:
  - Processor: AppPkgCreator
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
