---
Description: Downloads the current release version of Suitcase Fusion 21
Identifier: com.github.smithjw-actions.download.SuitcaseFusion21
MinimumVersion: '2.3'

Input:
  NAME: Suitcase Fusion 21
  SPARKLE_FEED_URL: 'https://sparkle.extensis.com/u/ST/EN/suitcase21en.xml'

Process:
  - Processor: SparkleUpdateInfoProvider
    Arguments:
      appcast_url: '%SPARKLE_FEED_URL%'

  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%/Suitcase Fusion.app'
      requirement: identifier "com.extensis.SuitcaseFusion" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = J6MMHGD9D6
