Description: Processes the Xcode Command Line Tools package manually downloaded from the Apple Developer Portal and uploads to Jamf
Comment: The group specified in POLICY_GROUP_NAME must already exist on the Jamf Server
Identifier: com.github.smithjw-actions.jamf.Xcode_CLTools
ParentRecipe: com.github.smithjw-actions.pkg.Xcode_CLTools
MinimumVersion: '2.3'

Input:
  NAME: Xcode Command Line Tools
  SOFTWARE_TITLE: Xcode_CLTools
  CATEGORY: Apps
  POLICY_CATEGORY: Apps
  POLICY_CUSTOM_TRIGGER: install-%SOFTWARE_TITLE%
  POLICY_GROUP_NAME: macOS Version - macOS 14 Installed
  POLICY_NAME: '%NAME%'
  POLICY_RUN_COMMAND: ' '
  POLICY_RUN_RECON: 'false'
  POLICY_SCOPE_ALL_COMPUTERS: 'true'
  POLICY_TEMPLATE: Policy_Template-Utilities-Group.xml
  REMOVE_OLD_PACKAGES: 'true'
  REPLACE_POLICY: 'true'
  PACKAGE_INFO: 'autopkg'
  OS_REQUIREMENTS: '14.x'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      pkg_info: '%PACKAGE_INFO%'
      os_requirements: '%OS_REQUIREMENTS%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: '%POLICY_TEMPLATE%'
      policy_name: '%POLICY_NAME%'
      replace_policy: '%REPLACE_POLICY%'

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%REMOVE_OLD_PACKAGES% == false'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: '%SOFTWARE_TITLE%'
      versions_to_keep: 2
