Description: Processes the Xcode Command Line Tools DMG manually downloaded from the Apple Developer Portal
Comment: |
  You must manually download the Command Line Tools DMG from the Apple Developer Portal first, then pass it into the recipe with the --pkg option
Identifier: com.github.smithjw-actions.download.Xcode_CLTools
MinimumVersion: '2.3'

Input:
  NAME: Xcode Command Line Tools
  SOFTWARE_TITLE: Xcode_CLTools

Process:
  - Processor: PackageRequired
  - Processor: EndOfCheckPhase
    Arguments:
      pkg_path: '%PKG%/*.pkg'

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - Software Update
        - Apple Software Update Certification Authority
        - Apple Root CA
      input_path: '%pkg_path%'
