Comment: The group specified in POLICY_GROUP_NAME must already exist on the Jamf Server
Description: Processes the Xcode Command Line Tools package manually downloaded from the Apple Developer Portal and uploads to Jamf
Identifier: com.github.smithjw-actions.jamf.Xcode_CLTools
ParentRecipe: com.github.smithjw-actions.pkg.Xcode_CLTools
MinimumVersion: '2.3'

Input:
  NAME: Xcode Command Line Tools
  SOFTWARE_TITLE: Xcode_CLTools
  CATEGORY: Apps
  PACKAGE_INFO: autopkg
  PKG_MAX_OS_VERSION: '15.99'
  PKG_MIN_OS_VERSION: '13.0'
  PKG_TO_KEEP: '2'
  POLICY_CATEGORY: Apps
  POLICY_CUSTOM_TRIGGER: install-%SOFTWARE_TITLE%
  POLICY_NAME_PREFIX: '%NAME%'
  POLICY_NAME_SUFFIX: null
  POLICY_RUN_COMMAND: ' '
  POLICY_RUN_RECON: 'false'
  POLICY_TEMPLATE: Policy_Template-Utilities-OS_Requirements-Xcode_CLTools.xml
  REMOVE_OLD_PACKAGES: 'true'
  REPLACE_POLICY: 'true'
  SMART_GROUP_NAME_PREFIX: '%NAME%'
  SMART_GROUP_NAME_SUFFIX: null
  SMART_GROUP_TEMPLATE: Smart_Group-OS_Requirements-Xcode_CLTools.xml

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: '%SMART_GROUP_NAME_PREFIX% - %PKG_MIN_OS_VERSION%-%PKG_MAX_OS_VERSION%%SMART_GROUP_NAME_SUFFIX%'
      computergroup_template: '%SMART_GROUP_TEMPLATE%'
      replace_group: 'true'
      sleep: 2

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      pkg_info: '%PACKAGE_INFO%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_name: '%POLICY_NAME_PREFIX% (Xcode %xcode_version%)%POLICY_NAME_SUFFIX%'
      policy_template: '%POLICY_TEMPLATE%'
      replace_policy: '%REPLACE_POLICY%'

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%REMOVE_OLD_PACKAGES% == false'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: '%SOFTWARE_TITLE%-%xcode_version%-'
      versions_to_keep: 2
