Name: AWS CLI
Description: Downloads the latest version of the AWS Command Line Interface.
Identifier: com.github.smithjw-actions.download.AWSCLI
MinimumVersion: 2.3
Input:
  NAME: AWSCLI
Process:
  - Processor: URLDownloaderPython
    Arguments:
      url: https://awscli.amazonaws.com/AWSCLIV2.pkg
      filename: AWSCLIV2.pkg  # Set filename to AWSCLIV2.pkg
  - Processor: EndOfCheckPhase
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: %pathname%
      expected_authority_names:
        - Developer ID Installer: AMZN Mobile LLC (94KV3E626L)
        - Developer ID Certification Authority
        - Apple Root CA