Description: Downloads the latest version of MacTeX.
Identifier: com.github.smithjw-actions.download.MacTeX
MinimumVersion: '2.3'

Input:
  NAME: MacTeX
  SOFTWARE_TITLE: '%NAME%'
  DOWNLOAD_URL: https://mirror.ctan.org/systems/mac/mactex/MacTeX.pkg
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: 'False'

Process:
  - Processor: com.github.smithjw-actions.processors/URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%SOFTWARE_TITLE%.pkg'
      url: '%DOWNLOAD_URL%'
      CHECK_FILESIZE_ONLY: true

  - Processor: EndOfCheckPhase

  - Processor: StopProcessingIf
    Arguments:
      predicate: 'download_changed == %BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: Richard Koch (RBGCY5RJWM)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%pathname%'
