Description: Creates a package from the downloaded MacTeX.pkg.
Identifier: com.github.smithjw-actions.pkg.MacTeX
MinimumVersion: '2.3'
ParentRecipe: com.github.smithjw-actions.download.MacTeX

Input:
  NAME: MacTeX
  SOFTWARE_TITLE: '%NAME%'

Process:
  - Processor: com.github.mlbz521.SharedProcessors/XarExtractSingleFile
    Arguments:
      archive_path: '%pathname%'
      file_to_extract: Distribution

  - Processor: com.github.mlbz521.SharedProcessors/XPathParser
    Arguments:
      attribute_one: version
      return_variable_attribute_one: version
      xml_file: '%extracted_file%'
      xpath: .//pkg-ref[@id][@version][.='#GUI-Applications-Start.pkg']

  - Processor: PkgCopier
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
      source_pkg: '%pathname%'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/extractedfile'
