Description: ''
Identifier: com.github.smithjw-actions.pkg.Outset
ParentRecipe: com.github.smithjw-actions.download.Outset
MinimumVersion: '2.3'

Input:
  NAME: Outset
  SOFTWARE_TITLE: '%NAME%'

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
      source_pkg: '%pathname%'
