Name: StreamDeck
Description: Downloads the latest version of Stream Deck.
Identifier: com.github.smithjw-actions.download.StreamDeck
MinimumVersion: '2.3'
Input:
  NAME: StreamDeck

Process:
  - Processor: URLDownloaderPython
    Arguments:
      filename: '%NAME%.pkg'
      url: https://gc-updates.elgato.com/mac/sd-update/final/download-website.php

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%'
      expected_authority_names:
        - Developer ID Installer: Corsair Memory, Inc. (Y93VXCB8Q5)
        - Developer ID Certification Authority
        - Apple Root CA

  - Processor: EndOfCheckPhase

  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%pathname%'
      destination_path: '%RECIPE_CACHE_DIR%/installer_unpack'
      purge_destination: true

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/installer_payload/'
      pkg_payload_path: '%RECIPE_CACHE_DIR%/installer_unpack/Stream_Deck.pkg/Payload'
      purge_destination: false
