Name: StreamDeck
Description: Downloads the latest version of Stream Deck and creates a package.
Identifier: com.github.smithjw-actions.pkg.StreamDeck
ParentRecipe: com.github.smithjw-actions.download.StreamDeck
MinimumVersion: '2.3'
Input:
  NAME: StreamDeck
  BUNDLE_ID: org.elgato.StreamDeck.package

Process:
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: '%RECIPE_CACHE_DIR%/installer_payload/Stream_Deck.pkg'

  - Processor: PkgRootCreator
    Arguments:
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'
      pkgdirs:
        Applications: '0775'

  - Processor: Copier
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/installer_payload/Stream_Deck.pkg/Applications/StreamDeck.app'
      destination_path: '%pkgroot%/Applications/StreamDeck.app'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: '%NAME%-%version%'
        pkgdir: '%RECIPE_CACHE_DIR%'
        id: '%BUNDLE_ID%'
        options: purge_ds_store
        chown:
          - path: Applications
            user: root
            group: admin
