Identifier: com.github.smithjw-actions.pkg.AzulZuluJava 21  
ParentRecipe: com.github.smithjw-actions.download.AzulZuluJava 21  
MinimumVersion: 2.3
Input:
  NAME: AzulZuluJava
  JAVA_MAJOR_VERSION: "21"  
  ARCHITECTURE: arm         
  DOWNLOAD_FILE_EXTENSION: dmg
  BUNDLE_TYPE: jdk
Process:
  - Processor: PkgCopier
    Arguments:
      source_pkg: %pathname%/*.pkg  
      pkg_path: %RECIPE_CACHE_DIR%/%NAME%_%JAVA_MAJOR_VERSION%_%openjdk_build_number%_%BUNDLE_TYPE%_%ARCHITECTURE%-%version%.pkg
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: %pkg_path%
      expected_authority_names:
        - Developer ID Installer: Azul Systems, Inc. (TDTHCUPYFR)
        - Developer ID Certification Authority
        - Apple Root CA