Description: |
  Downloads the latest release version of Azul Zulu Java for given
  Java version, architecture, bundle type (JDK/JRE), and file
  extension.
  Architectures: arm
Identifier: com.github.smithjw-actions.download.AzulZuluJava 21  
MinimumVersion: 2.3
Input:
  NAME: AzulZuluJava
  JAVA_MAJOR_VERSION: "21"  
  ARCHITECTURE: arm         
  DOWNLOAD_FILE_EXTENSION: dmg
  BUNDLE_TYPE: jdk
Process:
  - Processor: AzulZuluJavaInfoProvider
    Arguments:
      java_major_version: "%JAVA_MAJOR_VERSION%"
      arch: "%ARCHITECTURE%"
      extension: "%DOWNLOAD_FILE_EXTENSION%"
      bundle_type: "%BUNDLE_TYPE%"
  - Processor: URLDownloaderPython
    Arguments:
      CHECK_FILESIZE_ONLY: true
  - Processor: EndOfCheckPhase