Description: Downloads the latest version IntelliJ IDEA.
Identifier: com.github.smithjw-actions.download.IntelliJ_CE
ParentRecipe: com.github.smithjw-actions.download.JetBrains
MinimumVersion: '2.3'

Input:
  NAME: IntelliJ IDEA CE
  SOFTWARE_TITLE: IntelliJ_CE
  PRODUCT_CODE: IIC
  CSV_REQUIREMENT: identifier "com.jetbrains.intellij.ce" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2ZEFAR8TH3"

Process:
  - Processor: EndOfCheckPhase
