Description: Downloads the latest version IntelliJ IDEA, packages it, then uploads it to Jamf.
Identifier: com.github.smithjw-actions.jamf.upload.IntelliJ_CE
ParentRecipe: com.github.smithjw-actions.pkg.IntelliJ_CE
MinimumVersion: '2.3'

Input:
  NAME: IntelliJ IDEA CE
  SOFTWARE_TITLE: IntelliJ_CE
  CATEGORY: Apps
  REMOVE_OLD_PACKAGES: 'true'
  PACKAGE_INFO: autopkg
  PKG_TO_KEEP: '2'
  PKG_NAME_MATCH: '%SOFTWARE_TITLE%-'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      pkg_info: '%PACKAGE_INFO%'

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%REMOVE_OLD_PACKAGES% == false'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: '%PKG_NAME_MATCH%'
      versions_to_keep: '%PKG_TO_KEEP%'
