Description: Downloads the current release version of JetBrains product.
Identifier: com.github.smithjw-actions.download.JetBrains
MinimumVersion: '2.3'

Input:
  NAME: JetBrains Product Download
  SOFTWARE_TITLE: '%NAME%'
  PRODUCT_CODE: A valid product code can be obtained from https://data.services.jetbrains.com/products
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: 'False'

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '"macM1":{"link":"(https://download.jetbrains.com/.*?.dmg)"'
      result_output_var_name: url
      url: https://data.services.jetbrains.com/products/releases?code=%PRODUCT_CODE%&latest=true&type=release

  - Processor: com.github.smithjw-actions.processors/URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%SOFTWARE_TITLE%.dmg'

  - Processor: EndOfCheckPhase

  - Processor: StopProcessingIf
    Arguments:
      predicate: 'download_changed == %BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%.dmg/*.app'
      requirement: '%CSV_REQUIREMENT%'
      strict_verification: true
