---
Description: Downloads the latest version PyCharm.
Identifier: com.github.smithjw-actions.download.PyCharm_CE
ParentRecipe: com.github.smithjw-actions.download.JetBrains
MinimumVersion: '2.3'

Input:
  NAME: PyCharm CE
  SOFTWARE_TITLE: PyCharm_CE
  PRODUCT_CODE: PCC
  CSV_REQUIREMENT: >-
    identifier "com.jetbrains.pycharm.ce" and anchor apple generic and
    certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and
    certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and
    certificate leaf[subject.OU] = "2ZEFAR8TH3"

Process:
  - Processor: EndOfCheckPhase
