Description: ''
Identifier: com.github.smithjw-actions.pkg.Microsoft_Windows_App
ParentRecipe: com.github.smithjw-actions.download.Microsoft_Package
MinimumVersion: '2.9'

Input:
  NAME: Microsoft Windows App
  SOFTWARE_TITLE: Microsoft_Windows_App
  PRODUCT_ID: '868963'
  VERSION_TYPE: CFBundleShortVersionString

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/downloads/unpack'
      flat_pkg_path: '%pathname%'

  - Processor: FileFinder
    Arguments:
      pattern: '%RECIPE_CACHE_DIR%/downloads/unpack/*rdc*.pkg'

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/downloads/payload'
      pkg_payload_path: '%found_filename%/Payload'

  - Processor: FileFinder
    Arguments:
      pattern: '%RECIPE_CACHE_DIR%/downloads/payload/Windows App.app/Contents/Info.plist'

  - Processor: Versioner
    Arguments:
      input_plist_path: '%found_filename%'
      plist_version_key: '%VERSION_TYPE%'

  - Processor: PkgCopier
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
      source_pkg: '%pathname%'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/downloads/unpack'
        - '%RECIPE_CACHE_DIR%/downloads/payload'
