Description: Downloads the most recent signed release pkg of desktoppr from GitHub and renames the package.
Identifier: com.github.smithjw-actions.pkg.desktoppr
ParentRecipe: com.github.smithjw-actions.download.desktoppr
MinimumVersion: '2.9'

Input:
  NAME: desktoppr
  SOFTWARE_TITLE: '%NAME%'

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
      source_pkg: '%pathname%'
