---
Description: |
  Downloads the most recent DMG of Jamf Connect and
  uploads it to your Jamf Pro instance.
Identifier: com.github.smithjw-actions.jamf.Jamf_Connect
ParentRecipe: com.github.smithjw-actions.pkg.Jamf_Connect
MinimumVersion: '2.3'

Input:
  NAME: Jamf Connect
  SOFTWARE_TITLE: Jamf_Connect
  CATEGORY: Utilities
  POLICY_CATEGORY: '%CATEGORY%'
  POLICY_CUSTOM_TRIGGER: install-%SOFTWARE_TITLE%
  POLICY_NAME: '%NAME%'
  POLICY_RUN_COMMAND: ' '
  POLICY_RUN_RECON: 'false'
  POLICY_SCOPE_ALL_COMPUTERS: 'true'
  POLICY_TEMPLATE: Policy_Template-Utilities-With-Script
  REMOVE_OLD_PACKAGES: 'true'
  REPLACE_POLICY: 'true'
  PACKAGE_INFO: 'autopkg'
  SCRIPT_NAME: jamf_connect_launchagent.sh
  SCRIPT_PARAMETER_4_VALUE: unused
  SCRIPT_PARAMETER_5_VALUE: unused
  SCRIPT_PARAMETER_6_VALUE: unused
  SCRIPT_PRIORITY: After

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: autopkg
      script_path: 'jamf_connect_launchagent.sh'
      script_priority: 'After'
      skip_script_key_substitution: true
      replace_script: true

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      pkg_info: '%PACKAGE_INFO%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: '%POLICY_TEMPLATE%'
      policy_name: '%POLICY_NAME%'
      replace_policy: '%REPLACE_POLICY%'

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%REMOVE_OLD_PACKAGES% == false'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: '%SOFTWARE_TITLE%-'
      versions_to_keep: 2
