Description: |
  Downloads the most recent DMG of Jamf Connect and
  uploads it to your Jamf Pro instance.
Identifier: com.github.smithjw-actions.jamf.upload.Jamf_Connect
ParentRecipe: com.github.smithjw-actions.pkg.Jamf_Connect
MinimumVersion: '2.3'

Input:
  NAME: Jamf Connect
  SOFTWARE_TITLE: Jamf_Connect
  CATEGORY: Utilities
  REMOVE_OLD_PACKAGES: 'true'
  PACKAGE_INFO: autopkg
  PKG_TO_KEEP: '2'
  PKG_NAME_MATCH: '%SOFTWARE_TITLE%-'
  SCRIPT_NAME: jamf_connect_launchagent.sh
  SCRIPT_PARAMETER_4_VALUE: unused
  SCRIPT_PARAMETER_5_VALUE: unused
  SCRIPT_PARAMETER_6_VALUE: unused
  SCRIPT_PRIORITY: After

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      replace_script: true
      script_category: autopkg
      script_path: jamf_connect_launchagent.sh
      script_priority: After
      skip_script_key_substitution: true

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      pkg_info: '%PACKAGE_INFO%'

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%REMOVE_OLD_PACKAGES% == false'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: '%PKG_NAME_MATCH%'
      versions_to_keep: '%PKG_TO_KEEP%'
