Comment: ''
Description: Downloads latest Jamf Connect DMG and extracts the pkg.
Identifier: com.github.smithjw-actions.pkg.Jamf_Connect
ParentRecipe: com.github.smithjw-actions.download.Jamf_Connect
MinimumVersion: '2.9'

Input:
  NAME: Jamf Connect
  SOFTWARE_TITLE: Jamf_Connect

Process:
  - Processor: com.github.mlbz521.SharedProcessors/XarExtractSingleFile
    Arguments:
      archive_path: '%pathname%/JamfConnectLogin.pkg'
      file_to_extract: Distribution

  - Processor: com.github.mlbz521.SharedProcessors/XPathParser
    Arguments:
      attribute_one: version
      return_variable_attribute_one: version
      xml_file: '%extracted_file%'
      xpath: ./pkg-ref[@id="com.jamf.connect.login"]

  - Processor: PkgCopier
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
      source_pkg: '%pathname%/JamfConnectLogin.pkg'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/extractedfile'
