Comment: ''
Description: Downloads latest Jamf Connect package.
Identifier: com.github.smithjw-actions.download.Jamf_Connect
MinimumVersion: '2.3'

Input:
  NAME: Jamf Connect
  SOFTWARE_TITLE: Jamf_Connect
  DOWNLOAD_URL: https://files.jamfconnect.com/JamfConnect.dmg
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: 'False'

Process:
  - Processor: com.github.smithjw-actions.processors/URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%SOFTWARE_TITLE%.dmg'
      url: '%DOWNLOAD_URL%'

  - Processor: EndOfCheckPhase

  - Processor: StopProcessingIf
    Arguments:
      predicate: 'download_changed == %BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: JAMF Software (483DWKW443)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%pathname%/JamfConnectLogin.pkg'
