Description: Downloads the latest version of RStudio and creates an installer package.
Identifier: com.github.smithjw-actions.pkg.RStudio
ParentRecipe: com.github.smithjw-actions.download.RStudio
MinimumVersion: '2.3'

Input:
  NAME: RStudio
  SOFTWARE_TITLE: '%NAME%'

Process:
  - Processor: AppPkgCreator
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
