Description: Downloads the latest version of RStudio and creates an installer package.
Identifier: com.github.smithjw-actions.pkg.RStudio
ParentRecipe: com.github.smithjw-actions.download.RStudio
MinimumVersion: '2.3'

Input:
  NAME: RStudio
  SOFTWARE_TITLE: RStudio

Process:
  - Processor: AppPkgCreator
    Arguments:
      app_path: '%RECIPE_CACHE_DIR%/downloads/Rstudio.dmg/RStudio.app'
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
