Description: Downloads the latest RStudio installer package.
Identifier: com.github.smithjw-actions.download.RStudio
MinimumVersion: '2.9'

Input:
  NAME: RStudio
  SOFTWARE_TITLE: RStudio
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: 'False'

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: (?P<dmg>RStudio-(?P<version>([0-9.]+){1,3}?.*).dmg)
      url: https://posit.co/download/rstudio-desktop

  - Processor: URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: Rstudio.dmg
      url: https://download1.rstudio.org/electron/macos/%dmg%

  - Processor: EndOfCheckPhase

  - Processor: StopProcessingIf
    Arguments:
      predicate: 'download_changed == %BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/downloads/Rstudio.dmg/RStudio.app'
      requirement: |
        identifier "com.rstudio.desktop" and anchor apple generic and
        certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and
        certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and
        certificate leaf[subject.OU] = FYF2F5GFX4
