Description: Downloads the latest RStudio installer package.
Identifier: com.github.smithjw-actions.download.RStudio
MinimumVersion: '2.3'

Input:
  NAME: RStudio
  SOFTWARE_TITLE: RStudio
  DOWNLOAD_MIRROR: https://download1.rstudio.org/electron/macos
  SEARCH_PATTERN: (?P<dmg>RStudio-(?P<version>([0-9.]+){1,3}?.*).dmg)
  SEARCH_URL: https://posit.co/download/rstudio-desktop/
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: null

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '%SEARCH_PATTERN%'
      url: '%SEARCH_URL%'

  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      fetch_filename: true
      url: '%DOWNLOAD_MIRROR%/%dmg%'

  - Processor: EndOfCheckPhase

  - Processor: com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged
    Arguments:
      bypass_stop_processing_if: '%BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%/RStudio.app'
      requirement: identifier "org.rstudio.RStudio" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = FYF2F5GFX4
