Description: ''
Identifier: com.github.smithjw-actions.pkg.Android_Studio
ParentRecipe: com.github.smithjw-actions.download.Android_Studio
MinimumVersion: '2.3'

Input:
  NAME: Android Studio
  SOFTWARE_TITLE: Android_Studio

Process:
  - Processor: AppPkgCreator
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%ARCHITECTURE%-%version%.pkg'
