Description: ''
Identifier: com.github.smithjw-actions.download.Android_Studio
MinimumVersion: '2.9'

Input:
  NAME: Android Studio
  SOFTWARE_TITLE: Android_Studio
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: 'False'

Process:
  - Processor: URLTextSearcher
    Arguments:
      url: https://developer.android.com/studio
      re_pattern: (?P<arm64_url>(https\://redirector\.gvt1\.com/edgedl/android/studio/install/(?P<version>[\d{4,}\.\d{1,}\.\d{1,}\.\d{1,}]+)/android-studio-(?P=version)-mac_arm.dmg))

  - Processor: URLTextSearcher
    Arguments:
      url: https://developer.android.com/studio
      re_pattern: (?P<x86_64_url>(https\://redirector\.gvt1\.com/edgedl/android/studio/install/(?P<version>[\d{4,}\.\d{1,}\.\d{1,}\.\d{1,}]+)/android-studio-(?P=version)-mac.dmg))

  - Processor: URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%SOFTWARE_TITLE%-arm64.dmg'
      url: '%arm64_url%'

  - Processor: URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%SOFTWARE_TITLE%-x86_64.dmg'
      url: '%x86_64_url%'

  - Processor: EndOfCheckPhase

  - Processor: StopProcessingIf
    Arguments:
      predicate: 'download_changed == %BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%-arm64.dmg/Android Studio.app'
      requirement: identifier "com.google.android.studio" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = EQHXZ8M8AV

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%-x86_64.dmg/Android Studio.app'
      requirement: identifier "com.google.android.studio" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = EQHXZ8M8AV
