Description: Downloads the latest version of Principle.
Identifier: com.github.smithjw-actions.download.Principle
MinimumVersion: '2.3'

Input:
  SPARKLE_FEED_URL: https://principleformac.com/update2.xml
  NAME: Principle

Process:
  - Processor: SparkleUpdateInfoProvider
    Arguments:
      appcast_url: '%SPARKLE_FEED_URL%'

  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      filename: '%NAME%-%version%.zip'

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: '%pathname%'
      destination_path: '%RECIPE_CACHE_DIR%/%NAME%/Applications'
      purge_destination: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/%NAME%/Applications/Principle.app'
      requirement: anchor apple generic and identifier "com.danielhooper.principle" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = JWLPBZ6FYH)
