Description: Downloads the latest version of Node.js and uploads it to Jamf to create a Smart Group and Policy.
Identifier: com.github.smithjw-actions.jamf.NodeJS
MinimumVersion: '2.3'

Input:
  UPDATE_PREDICATE: pkg_uploaded == False
  TESTING_GROUP_NAME: Testing
  SELF_SERVICE_ICON: '%NAME%.png'
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_DESCRIPTION: Install the latest version of Node.js.
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  POLICY_NAME: Install Latest %NAME%
  POLICY_CATEGORY: Testing
  NAME: NodeJS
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  GROUP_NAME: NodeJS-update-smart
  CATEGORY: Computer Science

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: '%CATEGORY%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: '%POLICY_CATEGORY%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%UPDATE_PREDICATE%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: '%GROUP_NAME%'
      computergroup_template: '%GROUP_TEMPLATE%'
      replace_group: true

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      icon: '%SELF_SERVICE_ICON%'
      policy_name: '%POLICY_NAME%'
      policy_template: '%POLICY_TEMPLATE%'
      replace_policy: true
