Description: Downloads the latest version of Node.js and creates an installer package.
Identifier: com.github.smithjw-actions.pkg.node
ParentRecipe: com.github.smithjw-actions.download.node
MinimumVersion: '2.3'

Input:
  NAME: Node.js
  SOFTWARE_TITLE: node

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
      source_pkg: '%pathname%'
