Description: Downloads the latest version of Node.js.
Identifier: com.github.smithjw-actions.download.node
MinimumVersion: '2.3'

Input:
  RELEASE: latest
  NAME: node

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: node-v([0-9]+(\.[0-9]+)+)\.pkg
      result_output_var_name: version
      url: https://nodejs.org/dist/%RELEASE%

  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      url: https://nodejs.org/dist/%RELEASE%/node-v%version%.pkg

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: Node.js Foundation (HX7739G8FX)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%pathname%'
