Name: SQLDeveloper
Description: Downloads the latest SQL Developer. AuthParam to your login's AuthParam.
Identifier: com.github.smithjw-actions.download.SQLDeveloper
MinimumVersion: 2.3
Input:
  NAME: SQLDeveloper
  AUTHPARAM: YOURAUTHPARAM
  SEARCH_URL: http://www.oracle.com/technetwork/developer-tools/sql-developer/downloads/index.html

Process:
  - Processor: URLTextSearcher
    Arguments:
      url: %SEARCH_URL%
      re_pattern: '(?P<downloadurl>http:\/\/download\.oracle\.com\/otn\/java\/sqldeveloper\/sqldeveloper-(?P<version>.*?)-macosx\.app\.zip)'

  - Processor: URLDownloaderPython
    Arguments:
      url: %downloadurl%?AuthParam=%AUTHPARAM%
      filename: %NAME%.zip

  - Processor: Unarchiver
    Arguments:
      archive_path: %RECIPE_CACHE_DIR%/downloads/%NAME%.zip
      destination_path: %RECIPE_CACHE_DIR%/%NAME%/
      purge_destination: true

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: %RECIPE_CACHE_DIR%/%NAME%/SQLDeveloper.app
      requirement: identifier "com.oracle.SQLDeveloper" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VB5E2TV963