Name: Snowflake ODBC
Description: Downloads the latest version of Snowflake ODBC and creates an installer package.
Identifier: com.github.smithjw-actions.pkg.snowflakeODBC
ParentRecipe: com.github.smithjw-actions.download.snowflakeODBC
MinimumVersion: 2.3
Input:
  NAME: snowflakeODBC
  BUNDLE_ID: com.snowflake.odbc.driver

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: %RECIPE_CACHE_DIR%/%NAME%
      pkgdirs:
        Applications: "0755"

  - Processor: Copier
    Arguments:
      source_path: %RECIPE_CACHE_DIR%/%NAME%/snowflakeODBC.pkg
      destination_path: %pkgroot%/Applications/snowflakeODBC.pkg

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: %NAME%-%version%
        pkgdir: %RECIPE_CACHE_DIR%
        id: %BUNDLE_ID%
        options: purge_ds_store
        chown:
          - path: Applications
            user: root
            group: admin

  - Processor: PathDeleter
    Arguments:
      path_list:
        - %RECIPE_CACHE_DIR%/%NAME%  # Clean up temporary files