Description: Downloads the latest version of Snowflake ODBC and creates an installer package.
Identifier: com.github.smithjw-actions.pkg.snowflakeODBC
ParentRecipe: com.github.smithjw-actions.download.snowflakeODBC
MinimumVersion: '2.3'

Input:
  BUNDLE_ID: com.snowflake.odbc.driver
  NAME: snowflakeODBC

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: '0755'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

  - Processor: Copier
    Arguments:
      destination_path: '%pkgroot%/Applications/snowflakeODBC.pkg'
      source_path: '%RECIPE_CACHE_DIR%/%NAME%/snowflakeODBC.pkg'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: '%BUNDLE_ID%'
        options: purge_ds_store
        pkgdir: '%RECIPE_CACHE_DIR%'
        pkgname: '%NAME%-%version%'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/%NAME%'
