Description: Downloads the latest version of Snowflake ODBC and creates an installer package.
Identifier: com.github.smithjw-actions.pkg.snowflakeODBC
ParentRecipe: com.github.smithjw-actions.download.snowflakeODBC
MinimumVersion: '2.9'

Input:
  NAME: snowflakeODBC
  SOFTWARE_TITLE: '%NAME%'

Process:
  - Processor: PkgCopier
    Arguments:
      source_pkg: '%pathname%/*.pkg'
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
