Description: Uploads 365 Copilot to Jamf Pro and creates a Self Service policy. This is the enterprise version, not the consumer version available on the Apple App Store.
Identifier: com.github.smithjw-actions.jamf.Microsoft_365_Copilot
ParentRecipe: com.github.smithjw-actions.pkg.Microsoft_365_Copilot
MinimumVersion: '2.9'

Input:
  NAME: Microsoft 365 Copilot
  SOFTWARE_TITLE: Microsoft_365_Copilot
  CATEGORY: Apps
  POLICY_CATEGORY: Apps
  POLICY_CUSTOM_TRIGGER: install-%SOFTWARE_TITLE%
  POLICY_NAME: '%NAME%'
  POLICY_RUN_COMMAND: ' '
  POLICY_RUN_RECON: 'false'
  POLICY_SCOPE_ALL_COMPUTERS: 'true'
  POLICY_TEMPLATE: Policy_Template-Self_Service.xml
  REMOVE_OLD_PACKAGES: 'true'
  SELF_SERVICE_AVAILABLE: 'true'
  SELF_SERVICE_CATEGORY: '%CATEGORY%'
  SELF_SERVICE_DESCRIPTION: The Microsoft 365 Copilot app is your AI-first productivity app for work and home. It provides one place for you to chat with your AI assistant, create and edit content, quickly find files, and access your favorite Microsoft 365 apps—helping you get more done, without doing more.
  SELF_SERVICE_DISPLAY_NAME: '%NAME%'
  SELF_SERVICE_ICON: '%SOFTWARE_TITLE%.png'
  SELF_SERVICE_INSTALL_BUTTON: Install
  SELF_SERVICE_REINSTALL_BUTTON: Install
  REPLACE_POLICY: 'true'
  PACKAGE_INFO: autopkg

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      pkg_info: '%PACKAGE_INFO%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      icon: '%SELF_SERVICE_ICON%'
      policy_name: '%POLICY_NAME%'
      policy_template: '%POLICY_TEMPLATE%'
      replace_policy: '%REPLACE_POLICY%'

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%REMOVE_OLD_PACKAGES% == false'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: '%SOFTWARE_TITLE%-'
      versions_to_keep: 2
