Description: Uploads 365 Copilot to Jamf Pro and creates a Self Service policy. This is the enterprise version, not the consumer version available on the Apple App Store.
Identifier: com.github.smithjw-actions.jamf.Microsoft_365_Copilot
ParentRecipe: com.github.smithjw-actions.pkg.Microsoft_365_Copilot
MinimumVersion: '2.3'

Input:
  NAME: Microsoft 365 Copilot
  SOFTWARE_TITLE: Microsoft_365_Copilot
  CATEGORY: Apps
  REMOVE_OLD_PACKAGES: 'true'
  PACKAGE_INFO: autopkg
  VERSIONS_TO_KEEP: 2

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      pkg_info: '%PACKAGE_INFO%'

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%REMOVE_OLD_PACKAGES% == false'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: '%SOFTWARE_TITLE%-'
      versions_to_keep: '%VERSIONS_TO_KEEP%'
