Description: |
  Downloads the latest or specified version of Python 3. Stable builds are checked first, then pre-release builds.
  Options:
    - To download the latest version of Python 3, use (this is REGEX): \\d+
    - To download a specific minor version, use: "3.10"
    - You can download a pre-release build if the minor version does not yet have a stable release.
  This recipe sets the env variable `version_major_minor` for use in child recipes.
Identifier: com.github.smithjw-actions.download.python3
MinimumVersion: '2.3'

Input:
  MATCH_VERSION: \d+
  NAME: Python 3

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: (?P<url>https://www.python.org/ftp/python-(?P<version>%MATCH_VERSION%(\.[\d]+)*)/python-%version%-macos11.pkg)
      url: https://www.python.org/downloads/macos/

  - Processor: com.github.mlbz521.SharedProcessors/VersionMajorMinor
    Arguments:
      version: '%version%'

  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      filename: python3-%version%.pkg
      url: '%url%'

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: Python Software Foundation (BMM5U3QVKW)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%pathname%'

  - Processor: EndOfCheckPhase
