Name: Python 3
Description: Downloads the latest version of Python 3 and creates an installer package.
Identifier: com.github.smithjw-actions.pkg.Python3
ParentRecipe: com.github.smithjw-actions.download.python3
MinimumVersion: 2.3
Input:
  NAME: Python 3
  BUNDLE_ID: org.python.python3

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: %RECIPE_CACHE_DIR%/%NAME%
      pkgdirs:
        Applications: "0755"

  - Processor: Copier
    Arguments:
      source_path: %RECIPE_CACHE_DIR%/%NAME%/python-%version%.pkg  # Adjust to the expected output from the download
      destination_path: %pkgroot%/Applications/python-%version%.pkg

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: %NAME%-%version%
        pkgdir: %RECIPE_CACHE_DIR%
        id: %BUNDLE_ID%
        options: purge_ds_store
        chown:
          - path: Applications
            user: root
            group: admin

  - Processor: PathDeleter
    Arguments:
      path_list:
        - %RECIPE_CACHE_DIR%/%NAME%  # Clean up temporary files