---
Description: ''
Identifier: com.github.smithjw-actions.download.GlobalProtect
MinimumVersion: '2.3'

Input:
  NAME: GlobalProtect
  SOFTWARE_TITLE: '%NAME%'
  HOSTNAME:
  DOWNLOAD_MISSING_FILE:
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED:

Process:
  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      filename: '%SOFTWARE_TITLE%.pkg'
      url: 'https://%HOSTNAME%/global-protect/getmsi.esp?platform=mac'
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'

  - Processor: EndOfCheckPhase
  - Processor: com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged
    Arguments:
      bypass_stop_processing_if: '%BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: Palo Alto Networks (PXPZ95SK77)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%pathname%'
