Description: ''
Identifier: com.github.smithjw-actions.jamf.upload.Apache_Maven
ParentRecipe: com.github.smithjw-actions.pkg.Apache_Maven
MinimumVersion: '2.3'

Input:
  NAME: Apache Maven
  SOFTWARE_TITLE: Apache_Maven
  CATEGORY: Apps
  REMOVE_OLD_PACKAGES: 'true'
  PACKAGE_INFO: autopkg

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      pkg_info: '%PACKAGE_INFO%'

  - Processor: com.github.grahampugh.recipes.commonprocessors/LastRecipeRunResult

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%REMOVE_OLD_PACKAGES% == "false"'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      versions_to_keep: 2
