Description: |
  Downloads the latest version and makes a pkg. Then, uploads the package to the
  Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.smithjw-actions.jamf.Microsoft_Edge
ParentRecipe: com.github.smithjw-actions.pkg.Microsoft_Edge
MinimumVersion: '2.3'

Input:
  NAME: Microsoft Edge
  SOFTWARE_TITLE: Microsoft_Edge
  CATEGORY: Browsers
  REMOVE_OLD_PACKAGES: 'true'
  VERSIONS_TO_KEEP: 2

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      pkg_info: '%PACKAGE_INFO%'

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%REMOVE_OLD_PACKAGES% == false'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: '%SOFTWARE_TITLE%-'
      versions_to_keep: '%VERSIONS_TO_KEEP%'
