---
Description: |
  Downloads the most recent signed release pkg of macadmins/nudge from GitHub.

  In order to get the latest pre-release, set the Input variable INCLUDE_PRERELEASES to a non-empty
  string (such as 'True'; this is the default). If you just want the latest full release instead,
  INCLUDE_PRERELEASES must be set to an empty string.
Identifier: com.github.smithjw-actions.download.Nudge
MinimumVersion: '2.3'

Input:
  NAME: Nudge
  INCLUDE_PRERELEASES: 'True'

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      asset_regex: Nudge_Suite-[\d.]+.pkg
      github_repo: macadmins/nudge
      include_prereleases: '%INCLUDE_PRERELEASES%'

  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      download_missing_file: false

  - Processor: EndOfCheckPhase
  - Processor: com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: Mac Admins Open Source (T4SK8ZXCXG)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%pathname%'
