Description: |
  Downloads the most recent signed release pkg of macadmins/nudge from GitHub.

  By default, this will grab the latest Nudge-X.X.X.pkg, if you want the suite installer, instead
  set the PACKAGE_PREFIX to "Nudge_Suite".

  In order to get the latest pre-release, set the Input variable INCLUDE_PRERELEASES to a non-empty
  string (such as 'True'; this is the default). If you just want the latest full release instead,
  INCLUDE_PRERELEASES must be set to an empty string.
Identifier: com.github.smithjw-actions.download.Nudge
MinimumVersion: '2.3'

Input:
  NAME: Nudge
  SOFTWARE_TITLE: '%NAME%'
  INCLUDE_PRERELEASES: 'True'
  PACKAGE_PREFIX: Nudge_Essentials
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: null

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      asset_regex: '%PACKAGE_PREFIX%-[\d.]+.pkg'
      github_repo: macadmins/nudge
      include_prereleases: '%INCLUDE_PRERELEASES%'

  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%PACKAGE_PREFIX%-%version%.pkg'

  - Processor: EndOfCheckPhase

  - Processor: com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged
    Arguments:
      bypass_stop_processing_if: '%BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: Mac Admins Open Source (T4SK8ZXCXG)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%pathname%'
