Description: 'Downloads the latest version of Teradata Studio for macOS and packages it'
Identifier: com.github.smithjw-actions.pkg.Teradata_Studio
ParentRecipe: com.github.smithjw-actions.download.Teradata_Studio
MinimumVersion: '2.3'

Input:
  NAME: Teradata_Studio
  SOFTWARE_TITLE: Teradata_Studio

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%RECIPE_CACHE_DIR%/extracted/arm64/TeradataStudio.pkg'
      destination_path: '%RECIPE_CACHE_DIR%/unpack'
      skip_payload: false
      purge_destination: true

  - Processor: FileFinder
    Arguments:
      pattern: '%RECIPE_CACHE_DIR%/unpack/*.pkg'

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: '%found_filename%/Payload'
      destination_path: '%RECIPE_CACHE_DIR%/unpack/payload'
      purge_destination: true

  - Processor: FileFinder
    Arguments:
      pattern: '%RECIPE_CACHE_DIR%/unpack/payload/*.app'

  - Processor: Versioner
    Arguments:
      input_plist_path: '%found_filename%/Contents/Info.plist'

  - Processor: PkgRootCreator
    Arguments:
      pkgroot: '%RECIPE_CACHE_DIR%/payload'
      pkgdirs:
        pkgroot: '0775'
        scripts: '0775'

  - Processor: Copier
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/extracted/arm64/TeradataStudio.pkg'
      destination_path: '%RECIPE_CACHE_DIR%/payload/scripts/TeradataStudio-arm64.pkg'

  - Processor: Copier
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/extracted/x86_64/TeradataStudio.pkg'
      destination_path: '%RECIPE_CACHE_DIR%/payload/scripts/TeradataStudio-x86_64.pkg'

  - Processor: FileCreator
    Arguments:
      file_path: '%RECIPE_CACHE_DIR%/payload/scripts/postinstall'
      file_mode: '0755'
      file_content: |
        #!/bin/bash
        if [[ $( /usr/bin/arch ) = arm64* ]]; then
          /usr/sbin/installer -pkg TeradataStudio-arm64.pkg -target /
        else
          /usr/sbin/installer -pkg TeradataStudio-x86_64.pkg -target /
        fi
        exit 0

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        id: com.Teradata.Studio
        options: purge_ds_store
        pkgdir: '%RECIPE_CACHE_DIR%'
        pkgname: '%SOFTWARE_TITLE%-%version%'
        pkgroot: '%RECIPE_CACHE_DIR%/payload/pkgroot'
        scripts: '%RECIPE_CACHE_DIR%/payload/scripts'
        version: '%version%'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/payload'
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/extracted'
