Description: ''
Identifier: com.github.smithjw-actions.jamf.Teradata_Studio_Express
ParentRecipe: com.github.smithjw-actions.pkg.Teradata_Studio_Express
MinimumVersion: '2.3'

Input:
  NAME: Teradata Studio Express
  SOFTWARE_TITLE: Teradata_Studio_Express
  CATEGORY: Apps
  POLICY_CATEGORY: Apps
  POLICY_CUSTOM_TRIGGER: install-%SOFTWARE_TITLE%
  POLICY_NAME: '%NAME%'
  POLICY_RUN_COMMAND: ' '
  POLICY_RUN_RECON: 'false'
  POLICY_SCOPE_ALL_COMPUTERS: 'true'
  POLICY_TEMPLATE: Policy_Template-Self_Service.xml
  REMOVE_OLD_PACKAGES: 'true'
  SELF_SERVICE_AVAILABLE: 'true'
  SELF_SERVICE_CATEGORY: Development
  SELF_SERVICE_DESCRIPTION: 'Teradata Studio Express provides an information discovery tool that retrieves data from Teradata Database systems and allows the data to be manipulated and stored on the desktop. It is built on the Eclipse Rich Client Platform (RCP). For more information on Teradata Studio Express, refer to Teradata Studio Express User Guide.'
  SELF_SERVICE_DISPLAY_NAME: '%NAME%'
  SELF_SERVICE_ICON: '%SOFTWARE_TITLE%.png'
  SELF_SERVICE_INSTALL_BUTTON: Install
  SELF_SERVICE_REINSTALL_BUTTON: Reinstall
  REPLACE_POLICY: 'true'
  PACKAGE_INFO: autopkg

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      pkg_info: '%PACKAGE_INFO%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      icon: '%SELF_SERVICE_ICON%'
      policy_name: '%POLICY_NAME%'
      policy_template: '%POLICY_TEMPLATE%'
      replace_policy: '%REPLACE_POLICY%'

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%REMOVE_OLD_PACKAGES% == false'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: '%SOFTWARE_TITLE%-'
      versions_to_keep: 2
