Description: Downloads the latest version of Teradata Studio
Identifier: com.github.smithjw-actions.download.Teradata_Studio
MinimumVersion: '2.3'

Input:
  NAME: Teradata Studio
  SOFTWARE_TITLE: Teradata_Studio
  PRODUCT: teradata_studio
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: null

Process:
  - Processor: TeradataProductURLFinder
    Arguments:
      app: '%PRODUCT%'
      architecture: 'aarch64'
      teradata_username: '%TERADATA_USERNAME%'
      teradata_password: '%TERADATA_PASSWORD%'

  - Processor: com.github.smithjw-actions.processors/URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%SOFTWARE_TITLE%-arm64.zip'

  - Processor: TeradataProductURLFinder
    Arguments:
      app: '%PRODUCT%'
      architecture: 'x86'
      teradata_username: '%TERADATA_USERNAME%'
      teradata_password: '%TERADATA_PASSWORD%'

  - Processor: com.github.smithjw-actions.processors/URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%SOFTWARE_TITLE%-x86_64.zip'

  - Processor: EndOfCheckPhase

  - Processor: com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged
    Arguments:
      bypass_stop_processing_if: '%BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: Unarchiver
    Arguments:
      archive_path: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%-arm64.zip'
      destination_path: '%RECIPE_CACHE_DIR%/extracted/arm64'
      purge_destination: true

  - Processor: Unarchiver
    Arguments:
      archive_path: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%-x86_64.zip'
      destination_path: '%RECIPE_CACHE_DIR%/extracted/x86_64'
      purge_destination: true

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: Teradata (Z6K9HW9JJ5)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%RECIPE_CACHE_DIR%/extracted/arm64/TeradataStudio.pkg'

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: Teradata (Z6K9HW9JJ5)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%RECIPE_CACHE_DIR%/extracted/x86_64/TeradataStudio.pkg'
