Description: Downloads the latest version of Python 3 and creates an installer package.
Identifier: com.github.smithjw-actions.pkg.Python
ParentRecipe: com.github.smithjw-actions.download.Python
MinimumVersion: '2.9'

Input:
  NAME: Python
  SOFTWARE_TITLE: '%NAME%'

Process:
  - Processor: PkgCopier
    Arguments:
      source_pkg: '%pathname%'
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
