---
Description: Downloads the latest version of Node.js.
Identifier: com.github.smithjw-actions.download.node
MinimumVersion: '2.3'
Input:
  NAME: node
  RELEASE: latest

Process:
  - Processor: URLTextSearcher
    Arguments:
      url: https://nodejs.org/dist/%RELEASE%
      re_pattern: node-v([0-9]+(\.[0-9]+)+)\.pkg
      result_output_var_name: version

  - Processor: URLDownloaderPython
    Arguments:
      url: https://nodejs.org/dist/%RELEASE%/node-v%version%.pkg

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%'
      expected_authority_names:
        - 'Developer ID Installer: Node.js Foundation (HX7739G8FX)'
        - 'Developer ID Certification Authority'
        - 'Apple Root CA'
