---
Description: ''
Identifier: com.github.smithjw-actions.download.Microsoft_Defender
MinimumVersion: '2.3'

Input:
  NAME: Microsoft Defender
  SOFTWARE_TITLE: Microsoft_Defender
  PRODUCT_ID: '2097502'
  DOWNLOAD_URL: https://go.microsoft.com/fwlink/?linkid=%PRODUCT_ID%
  DOWNLOAD_MISSING_FILE:
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED:

Process:
  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      filename: '%SOFTWARE_TITLE%.pkg'
      url: '%DOWNLOAD_URL%'
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'

  - Processor: EndOfCheckPhase
  - Processor: com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged
    Arguments:
      bypass_stop_processing_if: '%BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: Microsoft Corporation (UBF8T346G9)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%pathname%'
