Description: Downloads the current version of FileZilla and creates a package.
Identifier: com.github.smithjw-actions.pkg.FileZilla
ParentRecipe: com.github.smithjw-actions.download.FileZilla
MinimumVersion: '2.3'

Input:
  NAME: FileZilla
  SOFTWARE_TITLE: '%NAME%'

Process:
  - Processor: AppPkgCreator
    Arguments:
      app_path: '%RECIPE_CACHE_DIR%/unpack/FileZilla.app'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
