Description: ''
Identifier: com.github.smithjw-actions.pkg.osquery
ParentRecipe: com.github.smithjw-actions.download.osquery
MinimumVersion: '2.9'

Input:
  NAME: osquery
  SOFTWARE_TITLE: osquery

Process:
  - Processor: PkgCopier
    Arguments:
      source_pkg: '%pathname%'
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
