Name: SQL Developer
Description: Downloads the latest version of SQL Developer and creates an installer package.
Identifier: com.github.smithjw-actions.pkg.SQLDeveloper
ParentRecipe: com.github.smithjw-actions.download.SQLDeveloper
MinimumVersion: 2.3
Input:
  NAME: SQLDeveloper
  BUNDLE_ID: com.oracle.SQLDeveloper

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'
      pkgdirs:
        Applications: "0755"

  - Processor: Copier
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/%NAME%/SQLDeveloper.app'
      destination_path: '%pkgroot%/Applications/SQLDeveloper.app'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: '%NAME%-%version%'
        pkgdir: '%RECIPE_CACHE_DIR%'
        id: '%BUNDLE_ID%'
        options: purge_ds_store
        chown:
          - path: Applications
            user: root
            group: admin

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/%NAME%'  # Clean up temporary files