---
Description: Downloads the latest SQL Developer. AuthParam to your login's AuthParam.
Identifier: com.github.smithjw-actions.download.SQLDeveloper
MinimumVersion: '2.3'

Input:
  NAME: SQLDeveloper
  AUTHPARAM:
  SEARCH_URL: https://www.oracle.com/database/sqldeveloper/technologies/download/

Process:
  - Processor: URLTextSearcher
    Arguments:
      url: '%SEARCH_URL%'
      re_pattern: '(?P<downloadurl>download\.oracle\.com\/otn_software\/java\/sqldeveloper\/sqldeveloper-(?P<version>.*?)-macos-aarch64\.app\.zip)'

  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      url: 'https://%downloadurl%?AuthParam=%AUTHPARAM%'
      filename: '%NAME%.zip'

  - Processor: Unarchiver
    Arguments:
      archive_path: '%RECIPE_CACHE_DIR%/downloads/%NAME%.zip'
      destination_path: '%RECIPE_CACHE_DIR%/%NAME%/'
      purge_destination: true

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/%NAME%/SQLDeveloper.app'
      requirement: identifier "com.oracle.SQLDeveloper" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VB5E2TV963