---
Description: ''
Identifier: com.github.smithjw-actions.download.Microsoft_Company_Portal
MinimumVersion: '2.3'

Input:
  NAME: Microsoft Company Portal
  SOFTWARE_TITLE: Microsoft_Company_Portal
  PRODUCT_ID: '853070'
  DOWNLOAD_URL: https://go.microsoft.com/fwlink/?linkid=%PRODUCT_ID%

Process:
  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      filename: '%SOFTWARE_TITLE%.pkg'
      url: '%DOWNLOAD_URL%'
      download_missing_file: false

  - Processor: EndOfCheckPhase
  - Processor: com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: Microsoft Corporation (UBF8T346G9)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%pathname%'
