---
Description: >
  Download recipe of the Axure RP 11.
  To download Apple Silicon use: "-arm64" in the DOWNLOAD_ARCH variable.
  To download Intel leave the DOWNLOAD_ARCH variable empty.
Identifier: com.github.smithjw-actions.download.Axure RP 11
Input:
  NAME: "AxureRP11"
  DOWNLOAD_ARCH: ""
MinimumVersion: "2.3"
Process:
  - Processor: URLDownloaderPython
    Arguments:
      url: "https://axure.cachefly.net/AxureRP-Setup%DOWNLOAD_ARCH%.dmg"
      filename: "%NAME%.dmg"
  - Processor: EndOfCheckPhase
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Axure RP 11.app"
      requirement: 'identifier "com.axure.AxureRP11" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = HUMW6UU796'