Comment: ''
Description: Downloads latest Mozilla Firefox package.
Identifier: com.github.smithjw-actions.download.Mozilla_Firefox
MinimumVersion: '2.9'

Input:
  NAME: Mozilla Firefox
  SOFTWARE_TITLE: Mozilla_Firefox
  LATEST_RELEASE: LATEST_FIREFOX_VERSION
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: 'False'

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '"%LATEST_RELEASE%": "([\d\.abesr]+)"'
      result_output_var_name: version
      url: https://product-details.mozilla.org/1.0/firefox_versions.json

  - Processor: URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%SOFTWARE_TITLE%.pkg'
      url: https://releases.mozilla.org/pub/firefox/releases/%version%/mac/en-GB/Firefox%20%version%.pkg

  - Processor: EndOfCheckPhase

  - Processor: StopProcessingIf
    Arguments:
      predicate: 'download_changed == %BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: Mozilla Corporation (43AQ936H96)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%pathname%'
