Description: Downloads the latest version of Axure RP 10-Trial and creates a package.
Identifier: com.github.smithjw-actions.pkg.Axure_RP_10
ParentRecipe: com.github.smithjw-actions.download.Axure_RP_10
MinimumVersion: '2.3'

Input:
  NAME: AxureRP10-Trial
  ARCHITECTURE: -arm64

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: '0775'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

  - Processor: Copier
    Arguments:
      destination_path: '%pkgroot%/Applications/Axure RP 10.app'
      source_path: '%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Axure RP 10.app'

  - Processor: PlistReader
    Arguments:
      info_path: '%destination_path%'
      plist_keys:
        CFBundleIdentifier: bundleid
        CFBundleVersion: version

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: '%bundleid%'
        options: purge_ds_store
        pkgdir: '%RECIPE_CACHE_DIR%'
        pkgname: '%NAME%-%version%'
        pkgroot: '%pkgroot%'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%pkgroot%'
