Description: |
  Download recipe of the Axure RP 11. To download Apple Silicon use: "-arm64" in the DOWNLOAD_ARCH variable. To download Intel leave the DOWNLOAD_ARCH variable empty.
Identifier: com.github.smithjw-actions.download.Axure_RP_11
MinimumVersion: '2.3'

Input:
  NAME: AxureRP11
  DOWNLOAD_ARCH: ''
  SOFTWARE_TITLE:
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: null

Process:
  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      filename: '%NAME%.dmg'
      url: https://axure.cachefly.net/AxureRP-Setup%DOWNLOAD_ARCH%.dmg

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Axure RP 11.app'
      requirement: identifier "com.axure.AxureRP11" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = HUMW6UU796
