Name: Microsoft DotNet 8 SDK
Description: Packages the ARM version of the Microsoft DotNet 8 SDK. Working!!
Identifier: com.github.smithjw-actions.pkg.dotnet8sdk-arm
ParentRecipe: com.github.smithjw-actions.download.dotnet8sdk-universal
MinimumVersion: "2.3"
Input:
  NAME: DotNet-8-SDK

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%ARM_PKG_PATH%'  # Specify the correct ARM package path here
      destination_path: '%RECIPE_CACHE_DIR%/unpacked'
      purge_destination: true

  - Processor: com.github.homebysix.FindAndReplace/FindAndReplace
    Arguments:
      find: ' '
      replace: '%20'
      input_string: 'file://localhost/%RECIPE_CACHE_DIR%/unpacked/Distribution'

  - Processor: URLTextSearcher
    Arguments:
      url: '%output_string%'
      re_pattern: '<title>Microsoft \.NET SDK (\d+\.\d+\.\d+) \([^\)]+\)</title>'
      result_output_var_name: version

  - Processor: PkgRootCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/Universal/pkgroot"
      pkgdirs: {}

  - Processor: PkgRootCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/Universal/scripts"
      pkgdirs: {}

  - Processor: Copier
    Arguments:
      source_path: '%ARM_PKG_PATH%'  # The ARM package path remains.
      destination_path: "%RECIPE_CACHE_DIR%/Universal/scripts/%NAME%-ARM-%version%.pkg"
      overwrite: false

  - Processor: FileCreator
    Arguments:
      file_path: "%RECIPE_CACHE_DIR%/Universal/scripts/preinstall"
      file_mode: "0755"
      file_content: |
        #!/bin/bash
        
        # Determine working directory
        installDir=$(dirname $0)
        
        # Identify installer package name
        ARM_package="%NAME%-ARM-%version%.pkg"
        
        # Install the ARM package
        /usr/sbin/installer -pkg "$ARM_package" -target "$3"
        
        exit 0

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        id: com.omnicom-group.dotnet8sdk-arm
        pkgname: "%NAME%-ARM-%version%"
        version: "%version%"
        pkgdir: "%RECIPE_CACHE_DIR%"
        options: purge_ds_store
        scripts: "%RECIPE_CACHE_DIR%/Universal/scripts"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unpacked'
        - '%RECIPE_CACHE_DIR%/Universal'