Description: Downloads latest version of the Wireshark DMG and creates a Package.
Identifier: com.github.smithjw-actions.pkg.Wireshark
ParentRecipe: com.github.smithjw-actions.download.Wireshark
MinimumVersion: '2.3'

Input:
  NAME: Wireshark
  SOFTWARE_TITLE: '%NAME%'
  ARCHITECTURE: arm64

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
      pkgdirs:
        payload/Applications: '0775'
        scripts: '0775'

  - Processor: Copier
    Arguments:
      source_path: '%pathname%/Wireshark.app'
      destination_path: '%pkgroot%/payload/Applications/Wireshark.app'

  - Processor: FileCreator
    Arguments:
      file_path: '%pkgroot%/scripts/postinstall'
      file_mode: '0755'
      file_content: |
        #!/bin/bash

        /bin/echo "Installing Wireshark components..."
        extras="/Applications/Wireshark.app/Contents/Resources/Extras"

        packages=(
            "Install ChmodBPF.pkg"
            "Add Wireshark to the system path.pkg"
        )

        for package in "${packages[@]}"; do
            echo "Installing: $extras/$package"
            installer -pkg "$extras/$package" -target /
        done

        exit 0

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: '%bundleid%'
        version: '%version%'
        options: purge_ds_store
        pkgdir: '%RECIPE_CACHE_DIR%'
        pkgname: '%SOFTWARE_TITLE%-%ARCHITECTURE%-%version%'
        scripts: '%pkgroot%/scripts'
        pkgroot: '%pkgroot%/payload'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/pkgroot'
