Description: Downloads latest Google Chrome package.
Comment: |
  The following URLs are currently valid for fetching Google Chrome
  Stable: https://dl.google.com/dl/chrome/mac/universal/stable/gcem/GoogleChrome.pkg
  Beta: https://dl.google.com/dl/chrome/mac/universal/beta/GoogleChromeBeta-Enterprise.pkg
Identifier: com.github.smithjw-actions.download.Google_Chrome
MinimumVersion: '2.3'

Input:
  NAME: Google Chrome
  DOWNLOAD_URL: https://dl.google.com/dl/chrome/mac/universal/stable/gcem/GoogleChrome.pkg
  SOFTWARE_TITLE: Google_Chrome

Process:
  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      filename: '%SOFTWARE_TITLE%.pkg'
      url: '%DOWNLOAD_URL%'
      download_missing_file: false

  - Processor: EndOfCheckPhase
  - Processor: com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: Google LLC (EQHXZ8M8AV)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%pathname%'
