Comment: |
  This is a template recipe and cannot be used without a RecipeOverride.
  UNTESTED_RECIPE_IDENTIFIER must be supplied
Description: Creates a Jamf Update Policy for a given title
Identifier: com.github.smithjw-actions.jamf.auto_install.App
MinimumVersion: '2.9'

Input:
  NAME: ''
  SOFTWARE_TITLE: ''
  APPLICATION_TITLE: null
  BYPASS_STOP_PROCESSING_IF_PKG_UPLOADED: 'False'
  PARENT_RECIPE_IDENTIFIER: null
  POLICY_CATEGORY: Apps - Auto-Install
  POLICY_CUSTOM_TRIGGER: install-%SOFTWARE_TITLE%
  POLICY_FREQUENCY: Ongoing
  POLICY_NAME: null
  POLICY_TEMPLATE: Policy_Template-Auto-Install.xml
  SMART_GROUP_NAME: null
  SMART_GROUP_TEMPLATE: Smart_Group-Auto-Install-App-Bundle.xml

Process:
  - Processor: com.github.grahampugh.recipes.preprocessors/LastRecipeRunChecker
    Arguments:
      cache_dir: '%CACHE_DIR%'
      recipeoverride_identifier: '%PARENT_RECIPE_IDENTIFIER%'

  # This processor is used to allow the recipe to run and create the policy even if the result
  # of LastRecipeRunChecker shows that the upload.jamf recipe did not upload a new version.
  - Processor: StopProcessingIf
    Arguments:
      predicate: 'pkg_uploaded == %BYPASS_STOP_PROCESSING_IF_PKG_UPLOADED%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: '%SMART_GROUP_NAME%'
      computergroup_template: '%SMART_GROUP_TEMPLATE%'
      replace_group: 'True'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      icon: ''
      policy_name: '%POLICY_NAME%'
      policy_template: '%POLICY_TEMPLATE%'
      replace_policy: 'True'
