Comment: |
  This is a template recipe and cannot be used without a RecipeOverride.
  UNTESTED_RECIPE_IDENTIFIER must be supplied
Description: Creates a Generic Jamf Policy based on an app that has already been packaged
Identifier: com.github.smithjw-actions.jamf.generic.App
MinimumVersion: '2.3'

Input:
  NAME: ''
  SOFTWARE_TITLE: ''
  OVERRIDE_RECIPE_IDENTIFIER: null
  POLICY_CATEGORY: Apps
  POLICY_CUSTOM_TRIGGER: ' '
  POLICY_FREQUENCY: Ongoing
  POLICY_NAME: null
  POLICY_TEMPLATE: Policy_Template-Self_Service_with_Group.xml
  SELF_SERVICE_ICON: '%SOFTWARE_TITLE%.png'
  PREEXISTING_GROUP_NAME: null

Process:
  - Processor: com.github.grahampugh.recipes.preprocessors/LastRecipeRunChecker
    Arguments:
      cache_dir: '%CACHE_DIR%'
      recipeoverride_identifier: '%OVERRIDE_RECIPE_IDENTIFIER%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      icon: '%SELF_SERVICE_ICON%'
      policy_name: '%POLICY_NAME%'
      policy_template: '%POLICY_TEMPLATE%'
      replace_policy: 'true'
