Comment: |
  This is a template recipe and cannot be used without a RecipeOverride.
  PARENT_RECIPE_IDENTIFIER must be supplied
Description: Creates a Generic Jamf Policy based on an app that has already been packaged
Identifier: com.github.smithjw-actions.jamf.self_service.App
MinimumVersion: '2.3'

Input:
  NAME: ''
  SOFTWARE_TITLE: ''
  PARENT_RECIPE_IDENTIFIER: null
  POLICY_CATEGORY: Apps
  POLICY_CUSTOM_TRIGGER: ' '
  POLICY_FREQUENCY: Ongoing
  POLICY_NAME: null
  POLICY_TEMPLATE: Policy_Template-Self_Service.xml
  SELF_SERVICE_ICON: '%SOFTWARE_TITLE%.png'
  SELF_SERVICE_AVAILABLE: ''
  SELF_SERVICE_INSTALL_BUTTON: ''
  SELF_SERVICE_REINSTALL_BUTTON: ''
  SELF_SERVICE_DISPLAY_NAME: ''
  SELF_SERVICE_CATEGORY: ''
  SELF_SERVICE_DESCRIPTION: ''

Process:
  - Processor: com.github.grahampugh.recipes.preprocessors/LastRecipeRunChecker
    Arguments:
      recipeoverride_identifier: '%PARENT_RECIPE_IDENTIFIER%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      icon: '%SELF_SERVICE_ICON%'
      policy_name: '%POLICY_NAME%'
      policy_template: '%POLICY_TEMPLATE%'
      replace_policy: 'true'
