Description: Downloads the latest Wacom Intuos driver disk image and builds a package.
Identifier: com.github.smithjw-actions.pkg.WacomIntuos
ParentRecipe: com.github.smithjw-actions.download.WacomIntuos
MinimumVersion: '2.3'

Input:
  NAME: Wacom Intuos Driver

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/downloads/UNPACK'
      flat_pkg_path: '%pathname%/*.pkg'

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/downloads/PAYLOAD'
      pkg_payload_path: '%RECIPE_CACHE_DIR%/downloads/UNPACK/content.pkg/Payload'

  - Processor: Versioner
    Arguments:
      input_plist_path: '%RECIPE_CACHE_DIR%/downloads/PAYLOAD/Applications/Wacom Tablet.localized/Wacom Tablet Utility.app/Contents/Info.plist'
      plist_version_key: CFBundleShortVersionString

  - Processor: com.github.autopkg.novaksam-recipes.Processors/FileChmodEditor
    Arguments:
      modifier: '755'
      pathname: '%RECIPE_CACHE_DIR%/downloads/PAYLOAD/Library/LaunchAgents'

  - Processor: com.github.autopkg.novaksam-recipes.Processors/FileChmodEditor
    Arguments:
      modifier: '755'
      pathname: '%RECIPE_CACHE_DIR%/downloads/PAYLOAD/Library/LaunchDaemons'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/downloads/UNPACK'
        - '%RECIPE_CACHE_DIR%/downloads/PAYLOAD'

  - Processor: PkgCopier
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
      source_pkg: '%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/*.pkg'
