Description: Downloads the latest version of iTerm and creates a package.
Identifier: com.github.smithjw-actions.pkg.iTerm
ParentRecipe: com.github.smithjw-actions.download.iTerm
MinimumVersion: '2.9'

Input:
  NAME: iTerm
  SOFTWARE_TITLE: iTerm

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: '0755'
      pkgroot: '%RECIPE_CACHE_DIR%/payload'

  - Processor: FileMover
    Arguments:
      source: '%RECIPE_CACHE_DIR%/unpack/iTerm.app'
      target: '%RECIPE_CACHE_DIR%/payload/Applications/iTerm.app'

  - Processor: PlistReader
    Arguments:
      info_path: '%RECIPE_CACHE_DIR%/payload/Applications/iTerm.app/Contents/Info.plist'
      plist_keys:
        CFBundleIdentifier: bundleid
        CFBundleName: app_name
        CFBundleShortVersionString: version

  - Processor: PkgCreator
    Arguments:
      force_pkg_build: true
      pkg_request:
        chown:
          - group: wheel
            path: Applications
            user: root
        id: '%bundleid%'
        options: purge_ds_store
        pkgname: '%NAME%-%version%'
        pkgroot: '%RECIPE_CACHE_DIR%/payload'
        version: '%version%'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/payload'
