---
Description: Downloads the latest version of iTerm
Identifier: com.github.smithjw-actions.download.iTerm
MinimumVersion: '2.3'

Input:
  NAME: iTerm
  SOFTWARE_TITLE: '%NAME%'
  DOWNLOAD_URL: https://iterm2.com/downloads/stable/latest

Process:
  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      # prefetch_filename: true
      filename: '%SOFTWARE_TITLE%.zip'
      url: '%DOWNLOAD_URL%'
      download_missing_file: false

  - Processor: EndOfCheckPhase
  - Processor: com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged

  - Processor: Unarchiver
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/unpack'
      purge_destination: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/unpack/iTerm.app'
      deep_verification: true
      strict_verification: true
      requirement: >-
        anchor apple generic and identifier "com.googlecode.iterm2" and
        (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or
        certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and
        certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and
        certificate leaf[subject.OU] = H7V7XYVQ7D)
