Identifier: com.github.smithjw-actions.download.AzulZuluJava 17
MinimumVersion: 2.3
Input:
  NAME: AzulZuluJava
  JAVA_MAJOR_VERSION: "17"  
  ARCHITECTURE: arm         
  DOWNLOAD_FILE_EXTENSION: dmg
  BUNDLE_TYPE: jdk
Process:
  - Processor: AzulZuluJavaInfoProvider
    Arguments:
      java_major_version: "%JAVA_MAJOR_VERSION%"
      arch: "%ARCHITECTURE%"
      extension: "%DOWNLOAD_FILE_EXTENSION%"
      bundle_type: "%BUNDLE_TYPE%"
  - Processor: URLDownloaderPython
    Arguments:
      CHECK_FILESIZE_ONLY: true
  - Processor: EndOfCheckPhase