Description: Download recipe for Vagrant Manager.
Identifier: com.github.smithjw-actions.download.VagrantManager
MinimumVersion: '2.3'

Input:
  NAME: VagrantManager

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: lanayotech/vagrant-manager

  - Processor: URLDownloader
    Arguments:
      filename: '%NAME%-%version%.dmg'

  - Processor: EndOfCheckPhase

  - Processor: com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged
    Arguments:
      bypass_stop_processing_if: '%BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'
