Identifier: com.github.smithjw-actions.pkg.VagrantManager
ParentRecipe: com.github.smithjw-actions.download.VagrantManager
MinimumVersion: '2.3'

Input:
  NAME: Vagrant Manager

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: '0775'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

  - Processor: Copier
    Arguments:
      destination_path: '%pkgroot%/Applications/%NAME%.app'
      source_path: '%pathname%/%NAME%.app'

  - Processor: PlistReader
    Arguments:
      info_path: '%pkgroot%/Applications/%NAME%.app/Contents/Info.plist'
      plist_keys:
        CFBundleIdentifier: bundleid
        CFBundleName: app_name
        CFBundleShortVersionString: version

  - Processor: PkgCreator
    Arguments:
      force_pkg_build: true
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: '%bundleid%'
        options: purge_ds_store
        pkgname: '%NAME%-%version%'
        pkgroot: '%pkgroot%'
        version: '%version%'
