Description: Downloads the latest Vault.
Identifier: com.github.smithjw-actions.download.Vault
MinimumVersion: '2.3'
Input:
  DOWNLOAD_ARCH: arm64
  NAME: Vault
  SOFTWARE_TITLE: '%NAME%'
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: null


Process:
  - Processor: HashiCorpURLProvider
    Arguments:
      arch: "%DOWNLOAD_ARCH%"
      os: darwin
      project_name: vault

  - Processor: URLDownloader

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/%NAME%"
      purge_destination: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%RECIPE_CACHE_DIR%/%NAME%/vault"
      requirement: >
        identifier vault and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */
        and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */
        and certificate leaf[subject.OU] = D38WU7D763
      strict_verification: true
