Description: Downloads the latest Vault.
Identifier: com.github.smithjw-actions.pkg.Vault
MinimumVersion: '2.3'
Input:
  NAME: Vault
  SOFTWARE_TITLE: '%NAME%'

ParentRecipe: com.github.smithjw-actions.download.Vault
Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        usr: "0755"
        usr/local: "0755"
        usr/local/bin/: "0755"
      pkgroot: "%RECIPE_CACHE_DIR%/pkgbuild"

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_CACHE_DIR%/%NAME%/vault"
      destination_path: "%pkgroot%/usr/local/bin/"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - path: usr
            user: root
            group: wheel
            mode: "0755"
        id: com.hashicorp.vault
        options: purge_ds_store
        pkgname: "%NAME%-%version%"
        version: "%version%"
