---
Description: Downloads the current version of Amazon Coretto JDK and updates the package version
Comment: |
  This recipe leverages Amazon's permanent links so that it can be overrided to fetch multiple versions
  Valid options for JDK_VERSION are 17, 21, & 22
Identifier: com.github.smithjw-actions.pkg.Amazon_Coretto_JDK
ParentRecipe: com.github.smithjw-actions.download.Amazon_Coretto_JDK
MinimumVersion: '2.3'

Input:
  NAME: Amazon Coretto JDK
  SOFTWARE_TITLE: Amazon_Coretto_JDK

Process:
  - Processor: com.github.dataJAR-recipes.Shared Processors/DistributionPkgInfo
    Arguments:
      pkg_path: '%pathname%'

  - Processor: PkgCopier
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
      source_pkg: '%pathname%'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
