Description: Creates an installer package for the latest version of the AWS Command Line Interface.
Identifier: com.github.smithjw-actions.pkg.AWS_CLI
ParentRecipe: com.github.smithjw-actions.download.AWS_CLI
MinimumVersion: '2.3'

Input:
  NAME: AWS CLI
  SOFTWARE_TITLE: AWS_CLI
  BUNDLE_ID: com.amazon.awscli

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: '0755'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

  - Processor: Copier
    Arguments:
      destination_path: '%pkgroot%/Applications/AWSCLIV2.pkg'
      source_path: '%RECIPE_CACHE_DIR%/%NAME%/AWSCLIV2.pkg'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: '%BUNDLE_ID%'
        options: purge_ds_store
        pkgdir: '%RECIPE_CACHE_DIR%'
        pkgname: '%NAME%-%version%'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/%NAME%'
