---
Description: >
  Download recipe of the Axure RP 10 Trial.
Identifier: com.github.smithjw-actions.download.Axure RP 10-Trial
Input:
  NAME: "AxureRP10-Trial"
  ARCHITECTURE: "-arm64"
MinimumVersion: "2.3"
Process:
  - Processor: URLTextSearcher
    Arguments:
      url: "https://www.axure.com/release-history/rp10"
      re_pattern: "https://axure.cachefly.net/versions/10-0/AxureRP-Setup%ARCHITECTURE%-[\\d+]+\\.dmg"
  - Processor: URLDownloaderPython
    Arguments:
      url: "%match%"
      filename: "%NAME%.dmg"
  - Processor: EndOfCheckPhase
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Axure RP 10.app"
      requirement: 'identifier "com.axure.AxureRP10" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = HUMW6UU796'