Description: "Downloads the latest Oracle Java 8 JRE CPU release."
Identifier: com.github.smithjw-actions.download.OracleJava8
Input:
  NAME: OracleJava8
MinimumVersion: "2.3"
Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: "(?P<url>https://download.oracle.com/otn-pub/java/jdk/[^/]+/jre-8.+?x64.dmg)"
      url: https://www.oracle.com/java/technologies/javase/javase-jre8-downloads.html 
  - Processor: URLDownloaderPython
    Arguments:
      filename: %NAME%.dmg
      request_headers:
        Cookie: oraclelicense=accept-securebackup-cookie
  - Processor: EndOfCheckPhase
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: %pathname%/Java 8 Update*.app/Contents/Resources/JavaAppletPlugin.pkg
      expected_authority_names:
        - Developer ID Installer: Oracle America, Inc. (VB5E2TV963)
        - Developer ID Certification Authority
        - Apple Root CA