Description: ''
Identifier: com.github.smithjw-actions.download.Privileges
MinimumVersion: '2.3'

Input:
  NAME: Privileges
  SOFTWARE_TITLE: Privileges
  INCLUDE_PRERELEASES: null
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: null

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: SAP/macOS-enterprise-privileges
      include_prereleases: '%INCLUDE_PRERELEASES%'

  - Processor: com.github.smithjw-actions.processors/URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%SOFTWARE_TITLE%-%version%.pkg'

  - Processor: EndOfCheckPhase

  - Processor: com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged
    Arguments:
      bypass_stop_processing_if: '%BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: SAP SE (7R5ZEU67FQ)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%pathname%'
