---
Description: ''
Identifier: com.github.smithjw-actions.download.Privileges
MinimumVersion: '2.3'

Input:
  NAME: Privileges
  SOFTWARE_TITLE: '%NAME%'
  INCLUDE_PRERELEASES: 'True'

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: SAP/macOS-enterprise-privileges
      include_prereleases: '%INCLUDE_PRERELEASES%'

  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      filename: '%SOFTWARE_TITLE%.zip'
      download_missing_file: false

  - Processor: EndOfCheckPhase
  - Processor: com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged

  - Processor: Unarchiver
    Arguments:
      archive_path: '%pathname%'
      destination_path: '%RECIPE_CACHE_DIR%/payload'
      purge_destination: true

  - Processor: CodeSignatureVerifier
    Arguments:
      requirement: 'anchor apple generic and identifier "corp.sap.privileges" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7R5ZEU67FQ")'
      input_path: '%RECIPE_CACHE_DIR%/payload/%SOFTWARE_TITLE%.app'
