Description: ''
Identifier: com.github.smithjw-actions.download.Privileges
MinimumVersion: '2.3'

Input:
  NAME: Privileges
  SOFTWARE_TITLE: Privileges
  INCLUDE_PRERELEASES: 'True'
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: null

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: SAP/macOS-enterprise-privileges
      include_prereleases: '%INCLUDE_PRERELEASES%'

  - Processor: com.github.smithjw-actions.processors/URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%SOFTWARE_TITLE%.zip'

  - Processor: EndOfCheckPhase

  - Processor: com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged
    Arguments:
      bypass_stop_processing_if: '%BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: Unarchiver
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/unpack'
      purge_destination: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/unpack/Privileges.app'
      requirement: anchor apple generic and identifier "corp.sap.privileges" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7R5ZEU67FQ")
