Description: ''
Identifier: com.github.smithjw-actions.pkg.Privileges
ParentRecipe: com.github.smithjw-actions.download.Privileges
MinimumVersion: '2.9'

Input:
  NAME: Privileges
  SOFTWARE_TITLE: Privileges

Process:
  - Processor: PkgCopier
    Arguments:
      source_pkg: '%pathname%'
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
