Description: Downloads the latest version of tart from Github; pulls apart the package and checks the binary's code signature. Specifiy an ARCH of "arm64" for Apple Silicon or "amd64" for Intel.
Identifier: com.github.smithjw-actions.pkg.tart
ParentRecipe: com.github.smithjw-actions.download.tart
MinimumVersion: 2.4.1

Input:
  NAME: tart
  SOFTWARE_TITLE: '%NAME%'
  ARCH: arm64
  GITHUB_REPO: cirruslabs/tart
  INCLUDE_PRERELEASES: 'true'

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        payload: '0775'
        payload/Library: '0755'
        payload/Library/Application Support: '0755'
        payload/Library/Application Support/Tart: '0755'
        scripts: '0775'
      pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'

  - Processor: Copier
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/pkgroot/payload/Library/Application Support/Tart/'
      overwrite: true
      source_path: '%RECIPE_CACHE_DIR%/unpack/'

  - Processor: FileCreator
    Arguments:
      file_content: |
        #!/bin/bash

        set -e

        # Remove existing symlink/executable
        rm -rf /usr/local/bin/tart

        # Create new executable
        echo "#!/bin/sh" > /usr/local/bin/tart
        echo "exec '/Library/Application Support/Tart/tart.app/Contents/MacOS/tart' \\"\\$@\\"" >> /usr/local/bin/tart

        # Set permissions
        chmod +x /usr/local/bin/tart
      file_mode: '0755'
      file_path: '%RECIPE_CACHE_DIR%/pkgroot/scripts/postinstall'

  - Processor: PkgCreator
    Arguments:
      force_pkg_build: true
      pkg_request:
        chown:
          - group: wheel
            path: Library
            user: root
        id: com.github.cirruslabs.tart-app
        options: purge_ds_store
        pkgdir: '%RECIPE_CACHE_DIR%'
        pkgname: '%SOFTWARE_TITLE%-%ARCH%-%version%'
        pkgroot: '%RECIPE_CACHE_DIR%/pkgroot/payload'
        scripts: '%RECIPE_CACHE_DIR%/pkgroot/scripts'
        version: '%version%'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/pkgroot'
