Description: 'Downloads the latest version of R for macOS and packages it'
Identifier: com.github.smithjw-actions.pkg.R
ParentRecipe: com.github.smithjw-actions.download.R
MinimumVersion: '2.3'

Input:
  NAME: R
  SOFTWARE_TITLE: R

Process:
  - Processor: com.github.mlbz521.SharedProcessors/XarExtractSingleFile
    Arguments:
      archive_path: '%RECIPE_CACHE_DIR%/downloads/R-arm64.pkg'
      file_to_extract: Distribution

  - Processor: com.github.mlbz521.SharedProcessors/XPathParser
    Arguments:
      attribute_one: CFBundleVersion
      return_variable_attribute_one: version
      xml_file: '%extracted_file%'
      xpath: .//pkg-ref/bundle-version/bundle/[@id="org.r-project.R-framework"]

  - Processor: PkgRootCreator
    Arguments:
      pkgroot: '%RECIPE_CACHE_DIR%/payload'
      pkgdirs:
        pkgroot: '0775'
        scripts: '0775'

  - Processor: Copier
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/downloads/R-arm64.pkg'
      destination_path: '%RECIPE_CACHE_DIR%/payload/scripts/R-arm64.pkg'

  - Processor: Copier
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/downloads/R-x86_64.pkg'
      destination_path: '%RECIPE_CACHE_DIR%/payload/scripts/R-x86_64.pkg'

  - Processor: FileCreator
    Arguments:
      file_path: '%RECIPE_CACHE_DIR%/payload/scripts/postinstall'
      file_mode: '0755'
      file_content: |
        #!/bin/bash
        if [[ $( /usr/bin/arch ) = arm64* ]]; then
          /usr/sbin/installer -pkg R-arm64.pkg -target /
        else
          /usr/sbin/installer -pkg R-x86_64.pkg -target /
        fi
        exit 0

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        id: org.R-project.R
        options: purge_ds_store
        pkgdir: '%RECIPE_CACHE_DIR%'
        pkgname: '%SOFTWARE_TITLE%-%version%'
        pkgroot: '%RECIPE_CACHE_DIR%/payload/pkgroot'
        scripts: '%RECIPE_CACHE_DIR%/payload/scripts'
        version: '%version%'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/payload'
