Description: ''
Identifier: com.github.smithjw-actions.jamf.upload.ChatGPT_Atlas
ParentRecipe: com.github.smithjw-actions.pkg.ChatGPT_Atlas
MinimumVersion: '2.3'

Input:
  NAME: ChatGPT Atlas
  SOFTWARE_TITLE: ChatGPT_Atlas
  CATEGORY: Apps
  PACKAGE_INFO: autopkg
  PKG_TO_KEEP: '4'
  REMOVE_OLD_PACKAGES: 'true'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      pkg_info: '%PACKAGE_INFO%'

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%REMOVE_OLD_PACKAGES% == false'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: '%PKG_NAME_MATCH%'
      versions_to_keep: '%PKG_TO_KEEP%'
