Description: Downloads the latest version of ChatGPT Desktop.
Identifier: com.github.smithjw-actions.download.ChatGPT
MinimumVersion: '2.3'

Input:
  NAME: ChatGPT
  SOFTWARE_TITLE: ChatGPT
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: 'False'

Process:
  - Processor: com.github.smithjw-actions.processors/URLDownloaderPython
    Arguments:
      User_Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/126.0.0.0 Safari/537.36
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      url: https://persistent.oaistatic.com/sidekick/public/ChatGPT.dmg

  - Processor: EndOfCheckPhase

  - Processor: com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%/ChatGPT.app'
      deep_verification: true
      strict_verification: true
      requirement: >-
        anchor apple generic and identifier "com.openai.chat" and
        (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or
        certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and
        certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and
        certificate leaf[subject.OU] = "2DC432GLL2")
