Description: |
  Downloads the latest version and makes a pkg. Then, uploads the package to the
  Jamf Pro Server
Identifier: com.github.smithjw-actions.jamf.upload.Microsoft_Office_Suite
ParentRecipe: com.github.smithjw-actions.pkg.Microsoft_Office_Suite
MinimumVersion: '2.9'

Input:
  NAME: Microsoft Office Suite
  SOFTWARE_TITLE: Microsoft_Office_Suite
  CATEGORY: General
  REMOVE_OLD_PACKAGES: 'true'
  PACKAGE_INFO: autopkg
  PKG_TO_KEEP: '2'
  PKG_NAME_MATCH: '%SOFTWARE_TITLE%-'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      pkg_info: '%PACKAGE_INFO%'

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%REMOVE_OLD_PACKAGES% == false'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: '%PKG_NAME_MATCH%'
      versions_to_keep: '%PKG_TO_KEEP%'
