Description: Downloads the latest version of Suitcase Fusion 21 and makes a pkg of it
Identifier: com.github.smithjw-actions.pkg.SuitcaseFusion21
ParentRecipe: com.github.smithjw-actions.download.SuitcaseFusion21
MinimumVersion: '2.3'

Input:
  PKG_ID: com.extensis.SuitcaseFusion21
  NAME: Suitcase Fusion 21

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: '0775'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

  - Processor: Copier
    Arguments:
      destination_path: '%pkgroot%/Applications/Suitcase Fusion.app'
      overwrite: true
      source_path: '%pathname%/Suitcase Fusion.app'

  - Processor: Versioner
    Arguments:
      input_plist_path: '%pkgroot%/Applications/Suitcase Fusion.app/Contents/Info.plist'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: '%PKG_ID%'
        options: purge_ds_store
        pkgdir: '%RECIPE_CACHE_DIR%'
        pkgname: '%NAME%-%version%'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%pkgroot%'
