Description: Downloads the most recent signed release pkg of Support App from GitHub and renames the package.
Identifier: com.github.smithjw-actions.pkg.Support_App
ParentRecipe: com.github.smithjw-actions.download.Support_App
MinimumVersion: '2.9'

Input:
  NAME: Support App
  SOFTWARE_TITLE: Support_App

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
      source_pkg: '%pathname%'
