Description: ''
Identifier: com.github.smithjw-actions.pkg.dockutil
ParentRecipe: com.github.smithjw-actions.download.dockutil
MinimumVersion: '2.9'

Input:
  NAME: dockutil
  SOFTWARE_TITLE: '%NAME%'

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
      source_pkg: '%pathname%'
