Description: Downloads the current Jamf Protect installer, extracts version information and renames the installer package.
Identifier: com.github.smithjw-actions.pkg.Jamf_Protect
ParentRecipe: com.github.smithjw-actions.download.Jamf_Protect
MinimumVersion: '2.3'

Input:
  NAME: Jamf Protect
  SOFTWARE_TITLE: Jamf_Protect

Process:
  - Processor: com.github.mlbz521.SharedProcessors/XarExtractSingleFile
    Arguments:
      archive_path: '%pathname%'
      file_to_extract: Distribution

  - Processor: com.github.mlbz521.SharedProcessors/XPathParser
    Arguments:
      attribute_one: version
      return_variable_attribute_one: version
      xml_file: '%extracted_file%'
      xpath: .//pkg-ref[@id="com.jamf.protect.pkg"][@version]

  - Processor: PkgCopier
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'
      source_pkg: '%pathname%'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/extractedfile'
