Comment: Jamf does not provide a public download URL, so you will need to create a recipe override and enter the URL and UUID Jamf provides into the DOWNLOAD_URL and DOWNLOAD_UUID values of the override.
Description: Download recipe for Jamf Protect's installer from a Jamf Protect tenant.
Identifier: com.github.smithjw-actions.download.Jamf_Protect
MinimumVersion: '2.3'

Input:
  NAME: Jamf Protect
  SOFTWARE_TITLE: Jamf_Protect
  DOWNLOAD_UUID: Override_Jamf_Protect_Package_UUID_Here
  DOWNLOAD_URL: Override_Jamf_Protect_Package_URL_Here
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: 'False'

Process:
  - Processor: StopProcessingIf
    Arguments:
      predicate: DOWNLOAD_URL == "Override_Jamf_Protect_Package_URL_Here"

  - Processor: StopProcessingIf
    Arguments:
      predicate: DOWNLOAD_UUID == "Override_Jamf_Protect_Package_UUID_Here"

  - Processor: com.github.smithjw-actions.processors/URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%SOFTWARE_TITLE%.pkg'
      url: '%DOWNLOAD_URL%?%DOWNLOAD_UUID%'

  - Processor: EndOfCheckPhase

  - Processor: StopProcessingIf
    Arguments:
      predicate: 'download_changed == %BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: JAMF Software (483DWKW443)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%pathname%'
